[[["a258e980-613f-4497-9d8c-4b42361605b4",{"pageContent":"\n      Course: CMSC100\n      Name: Bits and Bytes of Computer and Information Sciences\n      Description: Students are introduced to the fields (and disciplines) of computer science and information science within a small classroom setting. They will learn to make a successful transition from high school to the university, while exploring study skills, student success plans and research opportunities.\n      Credits: 1\n      Prerequisites: \n      Average GPA: 3.5051321928460344\n    ","metadata":{"course_id":"CMSC100","credits":1,"prerequisites":[]}}],["9ed69622-dfed-41c1-848a-aa9f6f11e853",{"pageContent":"\n      Course: CMSC106\n      Name: Introduction to C Programming\n      Description: Design and analysis of programs in C. An introduction to computing using structured programming concepts. Intended for students with no or minimal programming experience.\n      Credits: 4\n      Prerequisites: \n      Average GPA: 2.3862646566164156\n    ","metadata":{"course_id":"CMSC106","credits":4,"prerequisites":[]}}],["1e22d925-06af-417c-9c1a-b8743cef8713",{"pageContent":"\n      Course: CMSC122\n      Name: Introduction to Computer Programming via the Web\n      Description: Introduction to computer programming in the context of developing full featured dynamic web sites. Uses a problem solving approach to teach basics of program design and implementation using JavaScript; relates these skills to creation of dynamic web sites; then explores both the potential and limits of web-based information sources for use in research. Intended to help relate a student's major to these emerging technologies.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 2.5378168074699867\n    ","metadata":{"course_id":"CMSC122","credits":3,"prerequisites":[]}}],["b64b7dbd-fff7-4890-b0ac-c0ae7f546e11",{"pageContent":"\n      Course: CMSC125\n      Name: Introduction to Computing\n      Description: Introduces you to the computing field as a whole. You will gain skills used across the spectrum of computing majors and learn about the great variety of routes into the various areas of study and employment in technological fields.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC125","credits":3,"prerequisites":[]}}],["6c108f6c-673a-4297-a8f3-e39d80bed617",{"pageContent":"\n      Course: CMSC131\n      Name: Object-Oriented Programming I\n      Description: Introduction to programming and computer science. Emphasizes understanding and implementation of applications using object-oriented techniques. Develops skills such as program design and testing as well as implementation of programs using a graphical IDE. Programming done in Java.\n      Credits: 4\n      Prerequisites: MATH140\n      Average GPA: 2.4692104435357027\n    ","metadata":{"course_id":"CMSC131","credits":4,"prerequisites":["MATH140"]}}],["5ee1acf6-3aed-49cd-8cce-3cf756b85a8d",{"pageContent":"\n      Course: CMSC132\n      Name: Object-Oriented Programming II\n      Description: Introduction to use of computers to solve problems using software engineering principles. Design, build, test, and debug medium -size software systems and learn to use relevant tools. Use object-oriented methods to create effective and efficient problem solutions. Use and implement application programming interfaces (APIs). Programming done in Java.\n      Credits: 4\n      Prerequisites: CMSC131, MATH141\n      Average GPA: 2.6244683867309324\n    ","metadata":{"course_id":"CMSC132","credits":4,"prerequisites":["CMSC131","MATH141"]}}],["64dc815e-c763-47eb-8f9e-9d7f62cf5bc2",{"pageContent":"\n      Course: CMSC133\n      Name: Object Oriented Programming I Beyond Fundamentals\n      Description: An introduction to computer science and object-oriented programming for students with prior Java programming knowledge (conditionals, loops, methods). Program design, implementation, and testing using object-oriented techniques. All programming will be done in Java using a graphical IDE.\n      Credits: 2\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC133","credits":2,"prerequisites":[]}}],["d6df4226-ea8f-44b9-b485-557e1faf26ba",{"pageContent":"\n      Course: CMSC216\n      Name: Introduction to Computer Systems\n      Description: Introduction to the interaction between user programs and the operating system/hardware. Major topics include C programming, introductory systems programming, and assembly language. Other concepts covered include UNIX, machine data representation, thread management, optimization, and virtual memory. Programming is done in the Linux Environment.\n      Credits: 4\n      Prerequisites: CMSC132\n      Average GPA: 2.517170187325626\n    ","metadata":{"course_id":"CMSC216","credits":4,"prerequisites":["CMSC132"]}}],["62c8cb42-72c6-423b-bfa2-ef4c59e088b4",{"pageContent":"\n      Course: CMSC250\n      Name: Discrete Structures\n      Description: Fundamental mathematical concepts related to computer science, including finite and infinite sets, relations, functions, and propositional logic. Introduction to other techniques, modeling and solving problems in computer science. Introduction to permutations, combinations, graphs, and trees with selected applications.\n      Credits: 4\n      Prerequisites: CMSC131, MATH141\n      Average GPA: 2.6779751480276857\n    ","metadata":{"course_id":"CMSC250","credits":4,"prerequisites":["CMSC131","MATH141"]}}],["f42c20b8-ac7c-4324-a649-b55b2fa58b02",{"pageContent":"\n      Course: CMSC298A\n      Name: Special Topics in Computer Science\n      Description: \n      Credits: 1\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC298A","credits":1,"prerequisites":[]}}],["2406d7b2-2853-4b59-9d4d-a10b9e38cbd6",{"pageContent":"\n      Course: CMSC320\n      Name: Introduction to Data Science\n      Description: An introduction to the data science pipeline, i.e., the end-to-end process of going from unstructured, messy data to knowledge and actionable insights. Provides a broad overview of several topics including statistical data analysis, basic data mining and machine learning algorithms, large-scale data management, cloud computing, and information visualization.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 3.4170012547051427\n    ","metadata":{"course_id":"CMSC320","credits":3,"prerequisites":[]}}],["532f0732-010d-40ed-aeb1-7f3e3343484a",{"pageContent":"\n      Course: CMSC330\n      Name: Organization of Programming Languages\n      Description: A study of programming languages, including their syntax, semantics, and implementation. Several different models of languages are discussed, including dynamic, scripting (e.g., Ruby, Python) functional (e.g., OCaml, Haskell, Scheme), and memory safe systems programming (e.g., Rust). Explores language features such as formal syntax, scoping and binding of variables, higher-order programming, typing, and type polymorphism. Introduces finite automata, context free grammar, parsing, lambda calculus, and basics of security attacks and software security.\n      Credits: 3\n      Prerequisites: CMSC216, CMSC250\n      Average GPA: 2.8023680404916855\n    ","metadata":{"course_id":"CMSC330","credits":3,"prerequisites":["CMSC216","CMSC250"]}}],["4ea32638-2922-48c8-b41d-528cde16e4c7",{"pageContent":"\n      Course: CMSC335\n      Name: Web Application Development with JavaScript\n      Description: Provides an introduction to modern ways of developing Web Applications/Services using JavaScript for both front-end and back-end. The course covers topics on fundamental JavaScript language constructs, server-side JavaScript, back-end data persistence, and client-side JavaScript to build Web Applications that interact with Web services and back-end databases.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC335","credits":3,"prerequisites":[]}}],["5538f71f-4357-4a72-9cc4-2558aa4355a8",{"pageContent":"\n      Course: CMSC351\n      Name: Algorithms\n      Description: A systematic study of the complexity of some elementary algorithms related to sorting, graphs and trees, and combinatorics. Algorithms are analyzed using mathematical techniques to solve recurrences and summations.\n      Credits: 3\n      Prerequisites: CMSC250, MATH141\n      Average GPA: 2.486750423237993\n    ","metadata":{"course_id":"CMSC351","credits":3,"prerequisites":["CMSC250","MATH141"]}}],["b865c098-a811-42f6-ab6d-887833c4bf40",{"pageContent":"\n      Course: CMSC396H\n      Name: Computer Science Honors Seminar\n      Description: Overview of computer science research activities, techniques, and tools. Diverse research areas will be covered, including systems, networks, artificial intelligence, human-computer interaction, software engineering, graphics, vision, and theory.\n      Credits: 1\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC396H","credits":1,"prerequisites":[]}}],["7ae47b16-6ae1-40c9-aff0-09de7c113912",{"pageContent":"\n      Course: CMSC411\n      Name: Computer Systems Architecture\n      Description: Input/output processors and techniques. Intra-system communication, buses, caches. Addressing and memory hierarchies. Microprogramming, parallelism, and pipelining.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 2.8798516204607583\n    ","metadata":{"course_id":"CMSC411","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["a7b8492e-be28-475b-a9cb-b5701524d3bc",{"pageContent":"\n      Course: CMSC412\n      Name: Operating Systems\n      Description: A hands-on introduction to operating systems, including topics in: multiprogramming, communication and synchronization, memory management, IO subsystems, and resource scheduling polices. The laboratory component consists of constructing a small kernel, including functions for device IO, multi-tasking, and memory management.\n      Credits: 4\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 2.4906631762652705\n    ","metadata":{"course_id":"CMSC412","credits":4,"prerequisites":["CMSC330","CMSC351"]}}],["b2f47d6b-4cbc-4133-81b2-b70cd9cd3b3d",{"pageContent":"\n      Course: CMSC414\n      Name: Computer and Network Security\n      Description: An introduction to the topic of security in the context of computer systems and networks. Identify, analyze, and solve network-related security problems in computer systems. Fundamentals of number theory, authentication, and encryption technologies, as well as the practical problems that have to be solved in order to make those technologies workable in a networked environment, particularly in the wide-area Internet environment.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 2.8836707862214035\n    ","metadata":{"course_id":"CMSC414","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["d7bc7ebb-d3e1-4dc7-9f16-f436a2cfa5da",{"pageContent":"\n      Course: CMSC416\n      Name: Introduction to Parallel Computing\n      Description: Introduction to parallel computing. Topics include programming for shared memory and distributed memory parallel architectures, and fundamental issues in design, development, and performance analysis of parallel programs.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC416","credits":3,"prerequisites":[]}}],["f0b830b5-dfe1-484c-be3d-de327769b0f2",{"pageContent":"\n      Course: CMSC417\n      Name: Computer Networks\n      Description: Computer networks and architectures. The OSI model including discussion and examples of various network layers. A general introduction to existing network protocols. Communication protocol specification, analysis, and testing.\n      Credits: 3\n      Prerequisites: CMSC351\n      Average GPA: 2.3519290928050047\n    ","metadata":{"course_id":"CMSC417","credits":3,"prerequisites":["CMSC351"]}}],["80a492d3-072e-46e1-8f1b-8ae1d2950c93",{"pageContent":"\n      Course: CMSC420\n      Name: Advanced Data Structures\n      Description: Description, properties, and storage allocation functions of data structures including balanced binary trees, B-Trees, hash tables, skiplists, tries, KD-Trees and Quadtrees. Algorithms for manipulating structures. Applications from areas such as String Processing, Computer Graphics, Information Retrieval, Computer Networks, Computer Vision, and Operating Systems.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.0263691041468808\n    ","metadata":{"course_id":"CMSC420","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["2cdee30e-4b09-4c17-bd89-5f37f13fc329",{"pageContent":"\n      Course: CMSC421\n      Name: Introduction to Artificial Intelligence\n      Description: Introduces a range of ideas and methods in AI, varying semester to semester but chosen largely from: automated heuristic search, planning, games, knowledge representation, logical and statistical inference, learning, natural language processing, vision, robotics, cognitive modeling, and intelligent agents. Programming projects will help students obtain a hands-on feel for various topics.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.1262993762993774\n    ","metadata":{"course_id":"CMSC421","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["fd931027-eaa8-4e9a-b273-ac1b67a13b9d",{"pageContent":"\n      Course: CMSC422\n      Name: Introduction to Machine Learning\n      Description: Machine Learning studies representations and algorithms that allow machines to improve their performance on a task from experience. This is a broad overview of existing methods for machine learning and an introduction to adaptive systems in general. Emphasis is given to practical aspects of machine learning and data mining.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.163339011925041\n    ","metadata":{"course_id":"CMSC422","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["fa3589d1-91f7-42fb-ad6e-3e65c2ec72ab",{"pageContent":"\n      Course: CMSC423\n      Name: Bioinformatic Algorithms, Databases, and Tools\n      Description: An introduction to the main algorithms, databases, and tools used in bioinformatics. Topics may include assembly and analysis of genome sequences, reconstructing evolutionary histories, predicting protein structure, and clustering of biological data. Use of scripting languages to perform analysis tasks on biological data. No prior knowledge of biology is assumed.\n      Credits: 3\n      Prerequisites: CMSC351\n      Average GPA: 2.959897360703813\n    ","metadata":{"course_id":"CMSC423","credits":3,"prerequisites":["CMSC351"]}}],["3ce1d406-2f88-4bbe-8e77-61d24b54c1a7",{"pageContent":"\n      Course: CMSC424\n      Name: Database Design\n      Description: Students are introduced to database systems and motivates the database approach as a mechanism for modeling the real world. An in-depth coverage of the relational model, logical database design, query languages, and other database concepts including query optimization, concurrency control; transaction management, and log based crash recovery. Distributed and Web database architectures are also discussed.\n      Credits: 3\n      Prerequisites: CMSC351\n      Average GPA: 2.7143824027072756\n    ","metadata":{"course_id":"CMSC424","credits":3,"prerequisites":["CMSC351"]}}],["4b9db604-e80d-4d93-bd5b-b8f64238632e",{"pageContent":"\n      Course: CMSC425\n      Name: Game Programming\n      Description: An introduction to the principles and practice of computer game programming and design. This includes an introduction to game hardware and systems, the principles of game design, object and terrain modeling, game physics, artificial intelligence for games, networking for games, rendering and animation, and aural rendering. Course topics are reinforced through the design and implementation of a working computer game.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 3.2300602928509905\n    ","metadata":{"course_id":"CMSC425","credits":3,"prerequisites":[]}}],["9105c65f-ab59-40ce-ace4-9595a60d353b",{"pageContent":"\n      Course: CMSC426\n      Name: Computer Vision\n      Description: An introduction to basic concepts and techniques in computervision. This includes low-level operations such as image filtering and edge detection, 3D reconstruction of scenes using stereo and structure from motion, and object detection, recognition and classification.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.237830825116762\n    ","metadata":{"course_id":"CMSC426","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["01b33e1d-be19-4265-953a-f81732310fce",{"pageContent":"\n      Course: CMSC430\n      Name: Introduction to Compilers\n      Description: Topics include lexical analysis, parsing, intermediate representations, program analysis, optimization, and code generation.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.0738933601609655\n    ","metadata":{"course_id":"CMSC430","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["c225fc04-36e0-410a-994c-6966ccacda48",{"pageContent":"\n      Course: CMSC433\n      Name: Programming Language Technologies and Paradigms\n      Description: Programming language technologies (e.g., object-oriented programming), their implementations and use in software design and implementation.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 2.889482470784642\n    ","metadata":{"course_id":"CMSC433","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["ab53d395-8524-4452-aad7-1ddc3e9bdc37",{"pageContent":"\n      Course: CMSC434\n      Name: Introduction to Human-Computer Interaction\n      Description: Assess usability by quantitative and qualitative methods. Conduct task analyses, usability tests, expert reviews, and continuing assessments of working products by interviews, surveys, and logging. Apply design processes and guidelines to develop professional quality user interfaces. Build low-fidelity paper mockups, and a high-fidelity prototype using contemporary tools such as graphic editors and a graphical programming environment (eg: Visual Basic, Java).\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.3491322314049587\n    ","metadata":{"course_id":"CMSC434","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["3f221e90-2545-4bc9-add6-74596b801958",{"pageContent":"\n      Course: CMSC435\n      Name: Software Engineering\n      Description: State-of-the-art techniques in software design and development. Laboratory experience in applying the techniques covered. Structured design, structured programming, top-down design and development, segmentation and modularization techniques, iterative enhancement, design and code inspection techniques, correctness, and chief-programmer teams. The development of a large software project.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.0665242165242175\n    ","metadata":{"course_id":"CMSC435","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["b770dc68-73d4-4498-8333-17fa65937f82",{"pageContent":"\n      Course: CMSC436\n      Name: Programming Handheld Systems\n      Description: Fundamental principles and concepts that underlie the programming of handheld systems, such as mobile phones, personal digital assistants, and tablet computers. Particular emphasis will be placed on concepts such as limited display size, power, memory and CPU speed; and new input modalities, where handheld systems differ substantially from non-handheld systems, and thus require special programming tools and approaches. Students will apply these concepts and principles in the context of an existing handset programming platform.\n      Credits: 3\n      Prerequisites: CMSC330, CMSC351\n      Average GPA: 3.2231180996988944\n    ","metadata":{"course_id":"CMSC436","credits":3,"prerequisites":["CMSC330","CMSC351"]}}],["bbdacffb-e454-4629-86ca-5f70f6a30850",{"pageContent":"\n      Course: CMSC451\n      Name: Design and Analysis of Computer Algorithms\n      Description: Fundamental techniques for designing efficient computer algorithms, proving their correctness, and analyzing their complexity. General topics include graph algorithms, basic algorithm design paradigms (such as greedy algorithms, divide-and-conquer, and dynamic programming), network flows, NP-completeness, and other selected topics in algorithms.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 2.7538047655649502\n    ","metadata":{"course_id":"CMSC451","credits":3,"prerequisites":[]}}],["76fe659c-6781-4551-83ff-dbd56e5b2e96",{"pageContent":"\n      Course: CMSC454\n      Name: Algorithms for Data Science\n      Description: Fundamental methods for processing a high volume of data. Methods include stream processing, locally sensitive hashing, web search methods, page rank computation, network and link analysis, dynamic graph algorithms as well as methods to handle high dimensional data/dimensionality reduction.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC454","credits":3,"prerequisites":[]}}],["d399ceba-f06e-4f84-97bf-0e5d93b7d24f",{"pageContent":"\n      Course: CMSC456\n      Name: Cryptography\n      Description: The theory, application, and implementation of mathematical techniques used to secure modern communications. Topics include symmetric and public-key encryption, message integrity, hash functions, block-cipher design and analysis, number theory, and digital signatures.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 2.3666666666666667\n    ","metadata":{"course_id":"CMSC456","credits":3,"prerequisites":[]}}],["43c7140a-201d-4c44-ab7f-ddf4294a24a0",{"pageContent":"\n      Course: CMSC460\n      Name: Computational Methods\n      Description: Basic computational methods for interpolation, least squares, approximation, numerical quadrature, numerical solution of polynomial and transcendental equations, systems of linear equations and initial value problems for ordinary differential equations. Emphasis on methods and their computational properties rather than their analytic aspects. Intended primarily for students in the physical and engineering sciences.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 0\n    ","metadata":{"course_id":"CMSC460","credits":3,"prerequisites":[]}}],["26b8a871-5c11-4876-ba17-2c1538b264e3",{"pageContent":"\n      Course: CMSC466\n      Name: Introduction to Numerical Analysis I\n      Description: Floating point computations, direct methods for linear systems, interpolation, solution of nonlinear equations.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 0\n    ","metadata":{"course_id":"CMSC466","credits":3,"prerequisites":[]}}],["20afc084-ed33-4cbe-a41a-c52079a8747d",{"pageContent":"\n      Course: CMSC470\n      Name: Introduction to Natural Language Processing\n      Description: Introduction to fundamental techniques for automatically processing and generating natural language with computers. Machine learning techniques, models, and algorithms that enable computers to deal with the ambiguity and implicit structure of natural language. Application of these techniques in a series of assignments designed to address a core application such as question answering or machine translation.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC470","credits":3,"prerequisites":[]}}],["9456c2ea-38ff-44ae-a22c-c7b14bf4fe29",{"pageContent":"\n      Course: CMSC471\n      Name: Introduction to Data Visualization\n      Description: Datasets are becoming increasingly large and complex, requiring intuitive ways to explore and interpret them quickly and efficiently. In this case, a picture is worth a thousand words: visualizations enable us to transform data into images that are easier to understand and reason about, compared to raw numbers and raw text. Visualizations are critical tools in externalizing and organizing our knowledge and insights, whether to explore collected datasets to improve our understanding of the physical world, to assess and debug analysis/experimental workflows, or to present new and interesting results to diverse audiences. In this course we will study techniques and algorithms for creating effective visualizations based on principles from graphic design, perceptual psychology, and cognitive science. Students will learn how to design and build interactive visualizations for the web, using the D3.js (Data-Driven Documents) framework.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC471","credits":3,"prerequisites":[]}}],["f7e1dbba-2a9d-47b4-b986-bf90cce68c93",{"pageContent":"\n      Course: CMSC473\n      Name: Capstone in Machine Learning\n      Description: Semester-long project course in which each student will identify and carry out a project related to machine learning, with the goal of publishing a research paper or software tool.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC473","credits":3,"prerequisites":[]}}],["29e46465-2fc3-4a94-b326-a6b1764df2d6",{"pageContent":"\n      Course: CMSC474\n      Name: Introduction to Computational Game Theory\n      Description: Game theory deals with interactions among agents (either human or computerized) whose objectives and preferences may differ from the objectives and preferences of the other agents. It will also provide a comprehensive introduction to game theory, concentrating on its computational aspects.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 2.6927789934354482\n    ","metadata":{"course_id":"CMSC474","credits":3,"prerequisites":[]}}],["834beeb7-c1f0-4ef1-8bcd-1278569639c7",{"pageContent":"\n      Course: CMSC475\n      Name: Combinatorics and Graph Theory\n      Description: General enumeration methods, difference equations, generating functions. Elements of graph theory, matrix representations of graphs, applications of graph theory to transport networks, matching theory and graphical algorithms.\n      Credits: 3\n      Prerequisites: \n      Average GPA: 0\n    ","metadata":{"course_id":"CMSC475","credits":3,"prerequisites":[]}}],["35207448-c505-4d97-a682-91fc22114f33",{"pageContent":"\n      Course: CMSC498A\n      Name: Selected Topics in Computer Science\n      Description: An individualized course designed to allow a student or students to pursue a selected topic not taught as a part of the regular course offerings under the supervision of a Computer Science faculty member. Credit according to work completed.\n      Credits: 1\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC498A","credits":1,"prerequisites":[]}}],["6ee7f84e-cd98-4f50-81bd-88d0ca4f1a51",{"pageContent":"\n      Course: CMSC498B\n      Name: Selected Topics in Computer Science; Cloud Computing\n      Description: Prerequisites: Minimum grade of C- in CMSC330 and CMSC351. Explores several fundamental topics of cloud computing, including IaaS (e.g., Open Stack, Kubernetes), key big data platforms, and data center networking. The course combines group reading and discussion of influential publications in the field, lectures by the instructor, talksby invited speakers, and a large project. Students will be a part of an agile development team, with extensive experience with GitHub, agile tools, and various technologies. Each course project is solicited from open-source community and will be mentored by an industry leader and/or engineer, or a senior graduate student/postdoc.\n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC498B","credits":3,"prerequisites":[]}}],["092fc121-814d-4c58-801e-d0c6552954ee",{"pageContent":"\n      Course: CMSC498J\n      Name: Selected Topics in Computer Science\n      Description: \n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC498J","credits":3,"prerequisites":[]}}],["f66872d5-b343-446b-96c8-a9f3467dc9b6",{"pageContent":"\n      Course: CMSC498K\n      Name: Selected Topics in Computer Science; Multimodal Deep Learning\n      Description: \n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC498K","credits":3,"prerequisites":[]}}],["81cef906-e598-4ef3-928c-6d49c01f8938",{"pageContent":"\n      Course: CMSC498Z\n      Name: Selected Topics in Computer Science; Differentiable Programming\n      Description: \n      Credits: 3\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC498Z","credits":3,"prerequisites":[]}}],["953889ea-e18e-4362-87c0-3d075c66ad3f",{"pageContent":"\n      Course: CMSC499A\n      Name: Independent Undergraduate Research\n      Description: Students are provided with an opportunity to participate in a computer science research project under the guidance of a faculty advisor. Format varies. Students and supervising faculty member will agree to a research plan which must be approved by the department. As part of each research plan, students should produce a final paper delineating their contribution to the field.\n      Credits: 1\n      Prerequisites: \n      Average GPA: NaN\n    ","metadata":{"course_id":"CMSC499A","credits":1,"prerequisites":[]}}]],{"0":"a258e980-613f-4497-9d8c-4b42361605b4","1":"9ed69622-dfed-41c1-848a-aa9f6f11e853","2":"1e22d925-06af-417c-9c1a-b8743cef8713","3":"b64b7dbd-fff7-4890-b0ac-c0ae7f546e11","4":"6c108f6c-673a-4297-a8f3-e39d80bed617","5":"5ee1acf6-3aed-49cd-8cce-3cf756b85a8d","6":"64dc815e-c763-47eb-8f9e-9d7f62cf5bc2","7":"d6df4226-ea8f-44b9-b485-557e1faf26ba","8":"62c8cb42-72c6-423b-bfa2-ef4c59e088b4","9":"f42c20b8-ac7c-4324-a649-b55b2fa58b02","10":"2406d7b2-2853-4b59-9d4d-a10b9e38cbd6","11":"532f0732-010d-40ed-aeb1-7f3e3343484a","12":"4ea32638-2922-48c8-b41d-528cde16e4c7","13":"5538f71f-4357-4a72-9cc4-2558aa4355a8","14":"b865c098-a811-42f6-ab6d-887833c4bf40","15":"7ae47b16-6ae1-40c9-aff0-09de7c113912","16":"a7b8492e-be28-475b-a9cb-b5701524d3bc","17":"b2f47d6b-4cbc-4133-81b2-b70cd9cd3b3d","18":"d7bc7ebb-d3e1-4dc7-9f16-f436a2cfa5da","19":"f0b830b5-dfe1-484c-be3d-de327769b0f2","20":"80a492d3-072e-46e1-8f1b-8ae1d2950c93","21":"2cdee30e-4b09-4c17-bd89-5f37f13fc329","22":"fd931027-eaa8-4e9a-b273-ac1b67a13b9d","23":"fa3589d1-91f7-42fb-ad6e-3e65c2ec72ab","24":"3ce1d406-2f88-4bbe-8e77-61d24b54c1a7","25":"4b9db604-e80d-4d93-bd5b-b8f64238632e","26":"9105c65f-ab59-40ce-ace4-9595a60d353b","27":"01b33e1d-be19-4265-953a-f81732310fce","28":"c225fc04-36e0-410a-994c-6966ccacda48","29":"ab53d395-8524-4452-aad7-1ddc3e9bdc37","30":"3f221e90-2545-4bc9-add6-74596b801958","31":"b770dc68-73d4-4498-8333-17fa65937f82","32":"bbdacffb-e454-4629-86ca-5f70f6a30850","33":"76fe659c-6781-4551-83ff-dbd56e5b2e96","34":"d399ceba-f06e-4f84-97bf-0e5d93b7d24f","35":"43c7140a-201d-4c44-ab7f-ddf4294a24a0","36":"26b8a871-5c11-4876-ba17-2c1538b264e3","37":"20afc084-ed33-4cbe-a41a-c52079a8747d","38":"9456c2ea-38ff-44ae-a22c-c7b14bf4fe29","39":"f7e1dbba-2a9d-47b4-b986-bf90cce68c93","40":"29e46465-2fc3-4a94-b326-a6b1764df2d6","41":"834beeb7-c1f0-4ef1-8bcd-1278569639c7","42":"35207448-c505-4d97-a682-91fc22114f33","43":"6ee7f84e-cd98-4f50-81bd-88d0ca4f1a51","44":"092fc121-814d-4c58-801e-d0c6552954ee","45":"f66872d5-b343-446b-96c8-a9f3467dc9b6","46":"81cef906-e598-4ef3-928c-6d49c01f8938","47":"953889ea-e18e-4362-87c0-3d075c66ad3f"}]