{"documents":[{"pageContent":"Introduction to African American and Africana Studies\nSignificant aspects of the history of African Americans with particular emphasis on the evolution and development of black communities from slavery to the present. Interdisciplinary introduction to social, political, legal and economic roots of contemporary problems faced by blacks in the United States with applications to the lives of other racial and ethnic minorities in the Americas and in other societies.\nAverage GPA: N/A","metadata":{"course_id":"AAAS100","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to African American and Africana Studies","type":"gen_ed"}},{"pageContent":"Public Policy and the Black Community\nThe impact of public policies on the Black community and the role of the policy process in affecting the social, economic and political well-being of minorities. Particular attention given to the post-1960 to present era.\nAverage GPA: N/A","metadata":{"course_id":"AAAS101","credits":"3","prerequisites":[],"gen_ed":[["DSHS"]],"name":"Public Policy and the Black Community","type":"gen_ed"}},{"pageContent":"The New Jim Crow: African-Americans, Mass Incarceration and the Prison Industrial Complex\nStudents will examine the birth of the racial caste system following the abolition of slavery, the parallels between the racial hierarchy of the Jim Crow system and contemporary mass incarceration, and the rise of the prison industrial complex as a multi-billon business which thrives on the oppression of low-income populations and poor communities of color.\nAverage GPA: N/A","metadata":{"course_id":"AAAS187","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"The New Jim Crow: African-Americans, Mass Incarceration and the Prison Industrial Complex","type":"gen_ed"}},{"pageContent":"Black Culture in the United States\nThe course examines important aspects of African American life and thought which are reflected in African American literature, drama, music and art. Beginning with the cultural heritage of slavery, the course surveys the changing modes of Black creative expression from the 19th-century to the present.\nAverage GPA: N/A","metadata":{"course_id":"AAAS202","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Black Culture in the United States","type":"gen_ed"}},{"pageContent":"Get Out: The Sunken Place of Race Relations in the Post-Racial Era\nPrevailing thought suggests that we live in an era that is post-racial, particularly after the election of Barack Obama. Media often serves to drive our assessment of where our nation stands on issues like race, gender and sexuality. This course uses the film Get Out to delve into the production, evolution and significance of race in present day America. The course will engage multiple forms of media to investigate life in \"Post-Racial\" America, including but not limited to the role of stereotypes, interracial relationships, police-community relations, etc.\nAverage GPA: N/A","metadata":{"course_id":"AAAS211","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Get Out: The Sunken Place of Race Relations in the Post-Racial Era","type":"gen_ed"}},{"pageContent":"Social (In)Justice and African-American Health and Well-Being\nAfrican Americans suffer worse outcomes than non-Hispanic whites on nearly every health measure and outcomes that link to overall well-being like depressive symptoms or homicides. Health disparities are experienced by other underrepresented minority groups, but because of the unique historic and current experiences of African Americans, the determinants and solutions to African American health disparities are unique. The premise of this course is that African American health disparities are due to social injustices perpetuated on the institutional level that have permeated the lived experiences of African Americans leading to racial disparities in health and well-being. As such, the solutions on the both policy, and community, level must have a social justice approach.\nAverage GPA: N/A","metadata":{"course_id":"AAAS230","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Social (In)Justice and African-American Health and Well-Being","type":"gen_ed"}},{"pageContent":"Directed Readings in African American and Africana Studies\nThe readings will be directed by the faculty of African American Studies. Topics to be covered will be chosen to meet the needs and interests of individual students.\nAverage GPA: N/A","metadata":{"course_id":"AAAS400","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Directed Readings in African American and Africana Studies","type":"gen_ed"}},{"pageContent":"Introduction to Asian American Studies\nThe aggregate experience of Asian Pacific Americans, from developments in the countries of origin to their contemporary issues. The histories of Asian Pacific American groups as well as culture, politics, the media, and stereotypes, viewed from an interdisciplinary perspective.\nAverage GPA: N/A","metadata":{"course_id":"AAST200","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Asian American Studies","type":"gen_ed"}},{"pageContent":"Immigration and Ethnicity in the US\nExplores historical and contemporary Asian immigration to the US in comparison to and in the context of other immigrant groups. From low-skilled laborers to highly-skilled professionals, Asian and other immigrants have been an integral part of the shifting US economy and society since its inception. The course includes theories on why immigration occurs, determinants of its continuation, the uses of migrant labor, and immigrant adaptation and settlement. The second part of the course focuses on theories of ethnicity and racial formation and how immigrants develop and challenge the definitions of race, ethnicity, the \"other\", and ultimately, who is American. Students will also have the opportunity to gain first-hand knowledge of the immigrant experience through a life history interview project.\nAverage GPA: N/A","metadata":{"course_id":"AAST322","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Immigration and Ethnicity in the US","type":"gen_ed"}},{"pageContent":"Filipino American History and Biography\nFocus is placed on Filipino American experiences with an emphasis on identity, community building and organizing to influence public policy We will cover pertinent events from the US and Philippine history in order to understand the impact of colonialism, migration, immigration and assimilation on Filipino Americans.\nAverage GPA: N/A","metadata":{"course_id":"AAST363","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Filipino American History and Biography","type":"gen_ed"}},{"pageContent":"Asian American Politics\nStudents will gain a greater understanding of 1) the role of Asian Americans in US politics, 2) the political attitudes and behaviors of Asian Americans and 3) how to conduct research on Asian American politics. Though the class will concentrate on Asian Americans, issues related to Asian American politics will be examined within the larger context of America's multicultural political landscape.\nAverage GPA: N/A","metadata":{"course_id":"AAST443","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Asian American Politics","type":"gen_ed"}},{"pageContent":"Did Yeast Create Civilization?\nDid yeast create civilization?  Fermented foods have played a major role in the transition from nomadic to settled agrarian societies, the establishment of social and religious customs, the expansion of empires, and modern economies. To what extent are our past and current attitudes towards fermented foods rooted in historical and cultural imprints? Explore the central role of fermentation in human history and culture, the basic microbiological processes underlying fermentation processes, and the processes used to produce and distribute fermented foods. Find out how the fruits, grains, and dairy products used to produce fermented foods are grown and selected. Students will learn about the development and modern use of fermented dairy products, pickles, bread, tea, chocolate, wine, beer, distilled liquors, and pharmaceutical/manufactured products.\nAverage GPA: N/A","metadata":{"course_id":"AGST130","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"Did Yeast Create Civilization?","type":"gen_ed"}},{"pageContent":"American Culture in the Information Age\nExamines the ways in which content and form of public information interact with the culture, families & individuals.\nAverage GPA: N/A","metadata":{"course_id":"AMST260","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"American Culture in the Information Age","type":"gen_ed"}},{"pageContent":"Introduction to Asian American Studies\nThe aggregate experience of Asian Pacific Americans, from developments in the countries of origin to their contemporary issues. The histories of Asian Pacific American groups as well as culture, politics, the media, and stereotypes, viewed from an interdisciplinary perspective.\nAverage GPA: N/A","metadata":{"course_id":"AMST298C","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Asian American Studies","type":"gen_ed"}},{"pageContent":"Filipino American History and Biography\nFocus is placed on Filipino American experiences with an emphasis on identity, community building and organizing to influence public policy We will cover pertinent events from the US and Philippine history in order to understand the impact of colonialism, migration, immigration and assimilation on Filipino Americans.\nAverage GPA: N/A","metadata":{"course_id":"AMST323","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Filipino American History and Biography","type":"gen_ed"}},{"pageContent":"Asian American Politics\nStudents will gain a greater understanding of 1) the role of Asian Americans in US politics, 2) the political attitudes and behaviors of Asian Americans and 3) how to conduct research on Asian American politics. Though the class will concentrate on Asian Americans, issues related to Asian American politics will be examined within the larger context of America's multicultural political landscape.\nAverage GPA: N/A","metadata":{"course_id":"AMST498J","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Asian American Politics","type":"gen_ed"}},{"pageContent":"Introduction to Medical Anthropology and Global Health\nAn introduction to the central concepts in medical anthropology and the anthropology of global health. This course is a survey of anthropological notions of health, disease, and the body in cross-cultural and global contexts, including classic and contemporary texts. It will provide an examination of systems of knowledge and practice with regard to illness, healing, and global health inequities.\nAverage GPA: N/A","metadata":{"course_id":"ANTH210","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Medical Anthropology and Global Health","type":"gen_ed"}},{"pageContent":"Introduction to Archaeology\nExploration of the variety of past human societies and cultures through archaeology, from the emergence of anatomically modern humans to the more recent historical past.\nAverage GPA: N/A","metadata":{"course_id":"ANTH240","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Archaeology","type":"gen_ed"}},{"pageContent":"Introduction to Sociocultural Anthropology and Linguistics\nCulture and social relationships in a wide variety of settings from small-scale to complex societies. An overview of how anthropology analyzes human behavior. Particular attention to the relationship between language and culture.\nAverage GPA: N/A","metadata":{"course_id":"ANTH260","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Sociocultural Anthropology and Linguistics","type":"gen_ed"}},{"pageContent":"Anthropology of Global Health\nAn overview of the growing field of global health including health care systems, medical practices, ideas about illness in cross-cultural contexts, issues of health development, global health inequity, and human rights issues. The course will focus on the history of global health, the critique of major international health agencies and their development paradigms, and the political economy of social inequalities and health.\nAverage GPA: N/A","metadata":{"course_id":"ANTH265","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Anthropology of Global Health","type":"gen_ed"}},{"pageContent":"Changing Climate, Changing Cultures\nExplore past, present, and future interactions between humans and climate. Discussions, methods-oriented activities, and case study analyses provide students a foundation for appreciating the role of anthropology in understanding, responding to, and preparing for climate change.\nAverage GPA: N/A","metadata":{"course_id":"ANTH266","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC","SCIS"]],"name":"Changing Climate, Changing Cultures","type":"gen_ed"}},{"pageContent":"Archaeological Methods and Practice\nA team-taught, interdisciplinary course discussing theories, methods, and ethical issues in the practice of archaeology.\nAverage GPA: N/A","metadata":{"course_id":"ANTH305","credits":"3","prerequisites":[],"gen_ed":[["DSHS"]],"name":"Archaeological Methods and Practice","type":"gen_ed"}},{"pageContent":"Plagues, Pathogens and Public Policy\nThe impact of diseases on populations from prehistoric times through the present will be examined, along with public perceptions of disease, scientific breakthroughs on treatment and prevention, and the ways that politics and public health policies can enhance or impede the advancement of disease treatment. The natural history of disease, population structure, and immunity will be discussed. The class will address emerging and re-emerging diseases and the ways that first responders, researchers, and policy makers may affect the outcome of an outbreak.\nAverage GPA: N/A","metadata":{"course_id":"ANTH323","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"Plagues, Pathogens and Public Policy","type":"gen_ed"}},{"pageContent":"Elements of Agricultural and Resource Economics\nAn introduction to economic principles of production, marketing, agricultural prices and incomes, farm labor, credit, agricultural policies, and government programs.\nAverage GPA: N/A","metadata":{"course_id":"AREC250","credits":"3","prerequisites":[],"gen_ed":[["DSHS"]],"name":"Elements of Agricultural and Resource Economics","type":"gen_ed"}},{"pageContent":"The Science of Gender in Economics and Development\nIs science an objective enterprise that qualifies researchers to investigate gender free from the constraints and prejudice of their culture? We will investigate the process by which various scientific disciplines, including anthropology, evolutionary biology, psychology, and economics do research on the topic of gender. We will describe the current state of the literature on why different sexes exist and how sex translates into gender across different societies today. With a better understanding of the sources of sex and gender, we will examine how to research the reasons behind the highly divergent economic outcomes for men and women today. We will discuss these issues in the context of the labor market in developed countries like the US as well as a variety of contexts in developing countri es. A particular focus will be the techniques for learning more about the underlying reasons for these differences, how and whether they can be overcome, and if women play a specific role in improving economic outcomes in the poorest parts of the world.\nAverage GPA: N/A","metadata":{"course_id":"AREC260","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"The Science of Gender in Economics and Development","type":"gen_ed"}},{"pageContent":"Archaeological Methods and Practice\nA team-taught, interdisciplinary course discussing theories, methods, and ethical issues in the practice of archaeology.\nAverage GPA: N/A","metadata":{"course_id":"ARTH305","credits":"3","prerequisites":[],"gen_ed":[["DSHS"]],"name":"Archaeological Methods and Practice","type":"gen_ed"}},{"pageContent":"Ensuring your Financial Future Through Stock Investing\nIntroduces students to investing and trading, with special emphasis on the field of technical analysis.  Planning for one's financial future is a critical skill for all students. Students will learn how to evaluate companies using the investors.com website and the TC2000 stock charting program.  Students will develop an idea of the risks and benefits of investing, establishing a savings strategy, opening an IRA, and strategically planning for future financial security.  In addition to readings, lectures,  and online videos, students will participate in virtual stock market trading exercises and manage a virtual account.\nAverage GPA: N/A","metadata":{"course_id":"BSOS201","credits":"3","prerequisites":[],"gen_ed":[["DSHS"],["DSSP","SCIS"]],"name":"Ensuring your Financial Future Through Stock Investing","type":"gen_ed"}},{"pageContent":"States of Emergency\nStudents will explore the manner in which crises unfold from the perspective of a variety of emergency response disciplines, including: emergency management, law enforcement, intelligence analysis, cyber analysis, risk communication, health and human services, and emergency psychiatry/psychology.  Students will participate in a semester-long simulation of an unfolding terrorist attack.\nAverage GPA: N/A","metadata":{"course_id":"BSST334","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"States of Emergency","type":"gen_ed"}},{"pageContent":"Introduction to Criminal Justice\nIntroduction to the administration of criminal justice in a democratic society, with emphasis on the theoretical and historical development of law enforcement. The principles of organization and administration for law enforcement; functions and specific activities; planning and research; public relations; personnel and training; inspection and control; direction; policy formulation.\nAverage GPA: N/A","metadata":{"course_id":"CCJS100","credits":"3","prerequisites":[],"gen_ed":[["DSHS"]],"name":"Introduction to Criminal Justice","type":"gen_ed"}},{"pageContent":"Introduction to Criminology\nCriminal behavior and the methods of its study; causation; typologies of criminal acts and offenders; punishment, correction and incapacitation; prevention of crime.\nAverage GPA: N/A","metadata":{"course_id":"CCJS105","credits":"3","prerequisites":[],"gen_ed":[["DSHS"]],"name":"Introduction to Criminology","type":"gen_ed"}},{"pageContent":"African Civilization\nA survey of African civilizations from 4500 B.C. to present. Analysis of traditional social systems. Discussion of the impact of European colonization on these civilizations. Analysis of the influence of traditional African social systems on modern African institutions as well as discussion of contemporary processes of Africanization.\nAverage GPA: N/A","metadata":{"course_id":"AAAS200","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"African Civilization","type":"gen_ed"}},{"pageContent":"African-American Literature and Culture\nAn exploration of the stories black authors tell about themselves, their communities, and the nation as informed by time and place, gender, sexuality, and class. African American perspective themes such as art, childhood, sexuality, marriage, alienation and mortality, as well as representations of slavery, Reconstruction, racial violence and the Nadir, legalized racism and segregation, black patriotism and black ex-patriots, the optimism of integration, and the prospects of a post-racial America.\nAverage GPA: N/A","metadata":{"course_id":"AAAS234","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"African-American Literature and Culture","type":"gen_ed"}},{"pageContent":"Asian Americans in Film\nExplores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.\nAverage GPA: N/A","metadata":{"course_id":"AAST355","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Asian Americans in Film","type":"gen_ed"}},{"pageContent":"Asian American Women: The Social Construction of Gender\nExamines the intersection of gender, race and class as it relates to Asian American women in the United States; how institutionalized cultural and social statuses of gender, race, ethnicity and social class produce and reproduce inequality with implications for Asian Americans and the broader society.\nAverage GPA: N/A","metadata":{"course_id":"AAST420","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Asian American Women: The Social Construction of Gender","type":"gen_ed"}},{"pageContent":"South Asian American Literature and Culture\nExamines writing by South Asian American authors and authors writing about South Asian American issues. It explores major South Asian diaspora themes, considering how migration, war, the events of 9/11, global capitalism, and the changing socio-political and racial scene have affected South Asians in the United States. We will use a transnational approach to consider how writers and filmmakers explore gender, class, religious, caste, and other differences amongst South Asian Americans. We will also examine the place of South Asian Americans in relation to other Asian American populations. We will consider how South Asian American texts disrupt traditional literary classifications based on national identities by reflecting the complex global conditions, imperialistic and capitalistic expansion, and interconnectedness of peoples, nations, and cultures that have transformed American literature and conceptions of American identity.\nAverage GPA: N/A","metadata":{"course_id":"AAST440","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"South Asian American Literature and Culture","type":"gen_ed"}},{"pageContent":"Introduction American Studies\nIntroduces students to the interdisciplinary field of American Studies by examining concepts such as culture, identity, cultural practices, and globalization, as well as theories underlying these concepts. Engages key themes, especially constructions of difference and identity, cultures of everyday life, and America and the world.\nAverage GPA: N/A","metadata":{"course_id":"AMST101","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Introduction American Studies","type":"gen_ed"}},{"pageContent":"Popular Culture in America\nAn introduction to American popular culture, its historical development, and its role as a reflection of and influence on our culture and society.\nAverage GPA: N/A","metadata":{"course_id":"AMST203","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Popular Culture in America","type":"gen_ed"}},{"pageContent":"Film and American Culture Studies\nExploration of the American film from a historical perspective, illustrating the motion picture's role as an institutional phenomenon, as a form of communication, and as a source of cross-cultural study.\nAverage GPA: N/A","metadata":{"course_id":"AMST204","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Film and American Culture Studies","type":"gen_ed"}},{"pageContent":"American Material Culture: The Study of People, Places, and Things\nHistorical survey of American material culture. Ways of describing and interpreting accumulated material evidence (e.g., buildings, town plans) introduced by stressing relationship between artifact and culture.\nAverage GPA: N/A","metadata":{"course_id":"AMST205","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"American Material Culture: The Study of People, Places, and Things","type":"gen_ed"}},{"pageContent":"U.S. Latinx Literature and Culture\nExamines the poetry, prose, and theater of Latinx communities in the United States from their origins in the Spanish colonization of North America to their ongoing development in the 21st century. Considers how authors use literary form to gain insight into human experience, including mortality, religious belief, gender and sexuality, war and peace, family, language use, scientific inquiry, cultural tradition, ecology, and labor. Also studies how Latinx literary traditions have shaped and been shaped by broader currents in American literature, as well as what connections exist between Latinx literature and social and artistic developments in other parts of the world, particularly Latin America and the Caribbean. Authors may include Alvar Nunez Cabeza de Vaca, Eulalia Perez, Juan Nepomuceno Seguin, Maria Amparo Ruiz de Burton, Jose Marti, Arthur A. Schomburg, Jesus Colon, Julia de Burgos, Cesar Chavez, Ariel Dorfman, Gloria Anzaldua, Junot Diaz, and Cristina Garcia.\nAverage GPA: N/A","metadata":{"course_id":"AMST298Q","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"U.S. Latinx Literature and Culture","type":"gen_ed"}},{"pageContent":"(Dis)ability in American Film\nExplores the connection between film and disability through an analysis of independent and mainstream American films in various film genres. Specifically, we will consider how these film representations reflect and/or challenge the shifting social perspectives of disability over the 20th and 21st centuries.  Beginning with the presentation of disability as theatrical spectacle in the traveling sideshow and early cinema, we will work our way through film history to develop an understanding of our society's complicated relationship with disability.\nAverage GPA: N/A","metadata":{"course_id":"AMST320","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP","DVUP"]],"name":"(Dis)ability in American Film","type":"gen_ed"}},{"pageContent":"Asian Americans in Film\nExplores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.\nAverage GPA: N/A","metadata":{"course_id":"AMST328W","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Asian Americans in Film","type":"gen_ed"}},{"pageContent":"Design Thinking and Architecture\nExamines conceptual, perceptual, behavioral, and technical aspects of the built environment, and methods of analysis, problem-solving, and design implementation.\nAverage GPA: N/A","metadata":{"course_id":"ARCH170","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Design Thinking and Architecture","type":"gen_ed"}},{"pageContent":"History of World Architecture II\nPost-1500 - History of Architecture survey course - History of Architecture structured to develop critical thinking and visually literacy with regard to the worldwide legacy of design thinking and building innovation in architecture\nAverage GPA: N/A","metadata":{"course_id":"ARCH226","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"History of World Architecture II","type":"gen_ed"}},{"pageContent":"Introduction to Humanities, Health, and Medicine\nAn overview of the historical, cultural, ethical, and spiritual dimensions of medicine, human health, disease, and death from the points of view of various humanistic disciplines.\nAverage GPA: N/A","metadata":{"course_id":"ARHU230","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Introduction to Humanities, Health, and Medicine","type":"gen_ed"}},{"pageContent":"Writing for the Stage and Screen: An Introductory Workshop\nIntroduction to the theory and practice of scriptwriting with an opportunity to read, view, evaluate, write, and revise texts meant to be performed. Students will practice writing for the stage, film, and television and also examine selected scripts, performances, and film and television clips as models for their own creative work. Students will complete frequent writing exercises, participate in workshops, and learn to apply scholarship to the analysis and critique of scripts.\nAverage GPA: N/A","metadata":{"course_id":"ARHU275","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writing for the Stage and Screen: An Introductory Workshop","type":"gen_ed"}},{"pageContent":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Prose\nJimenez-Porter Writers' House students.\nAverage GPA: N/A","metadata":{"course_id":"ARHU319A","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Prose","type":"gen_ed"}},{"pageContent":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Exploring the Contemporary Revolution in Poetic Practice\nJimenez-Porter Writers' House students.\nAverage GPA: N/A","metadata":{"course_id":"ARHU319D","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Exploring the Contemporary Revolution in Poetic Practice","type":"gen_ed"}},{"pageContent":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Criminal Intent: The Craft of Crime Fiction\nJimenez-Porter Writers' House students. This workshop delves into the craft of crime fiction, from noir and hardboiled detectives to psychological thrillers and literary crime. Students will explore plotting, suspense, moral ambiguity, and character psychology while developing their own stories. Through readings, discussions, and exercises, we'll examine how crime fiction reflects societal anxieties, justice, and corruption. Authors like Tod Goldberg, Tana French, Vu Tran, Ivy Pochoda, Juliet Grames, Lauren Groff, Hector Acostaand S.A. Cosby will guide our study. Students will workshop original crime fiction, refining prose and deepening narratives. By semester's end, they will complete a polished crime story, gaining insight into crime fiction's artistic and social impact.\nAverage GPA: N/A","metadata":{"course_id":"ARHU319E","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Criminal Intent: The Craft of Crime Fiction","type":"gen_ed"}},{"pageContent":"Art and Society in Ancient and Medieval Europe and the Mediterranean\nExamines the material culture and visual expressions of Mediterranean and European societies from early times until ca. 1300 CE, emphasizing the political, social, and religious context of the works studied, the relationships of the works to the societies that created them, and the interrelationship of these societies.\nAverage GPA: N/A","metadata":{"course_id":"ARTH200","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Art and Society in Ancient and Medieval Europe and the Mediterranean","type":"gen_ed"}},{"pageContent":"Art and Society in the West from the Renaissance to the Present\nExamines representative European and American works of art from the later Middle Ages to the present, highlighting the dynamic exchange between artistic and cultural traditions both within periods and across time.\nAverage GPA: N/A","metadata":{"course_id":"ARTH201","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Art and Society in the West from the Renaissance to the Present","type":"gen_ed"}},{"pageContent":"Monuments, Monumentality, and the Art of Memorial\nWhy do societies create monuments? And why do they preserve and destroy, change and remove them? How do monuments embody cultural values, shape historical narratives, and become sites of mourning and memory? This course investigates the political and cultural work of monuments across time and space, from the ancient world to European empires to the contemporary United States. The issues we consider include intercultural exchange and religious contexts, race and representation, and appropriation and iconoclasm.\nAverage GPA: N/A","metadata":{"course_id":"ARTH261","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP","SCIS"]],"name":"Monuments, Monumentality, and the Art of Memorial","type":"gen_ed"}},{"pageContent":"Public Art\nHow does public art function on a university campus, in major cities, and across the United States? This course invites students to empirically study the modern history and civic values of public art spanning sculpture, painting, mixed-media, and installation. We consider the nature of public space, the politics of representation and community, and the civic and memorial functions of art. The course is built around a semester-long project in which students will commission a work of public art for our College Park campus.\nAverage GPA: N/A","metadata":{"course_id":"ARTH262","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Public Art","type":"gen_ed"}},{"pageContent":"How (and Why) to Look at Art in the Era of Climate Change\nHow can art help us build the mindset necessary for fashioning a sustainable civilization? Paintings, photographs, films, novels, songs, and other creative works as they shape beliefs related to sustainability and justice.\nAverage GPA: N/A","metadata":{"course_id":"ARTH265","credits":"3","prerequisites":[],"gen_ed":[["DSHU","SCIS"]],"name":"How (and Why) to Look at Art in the Era of Climate Change","type":"gen_ed"}},{"pageContent":"Roman Art and Archaeology\nSites and monuments of painting, sculpture, architecture, and the minor arts from the earliest times through the third century A.D. with emphasis on the Italian peninsula from the Etruscan period through that of Imperial Rome.\nAverage GPA: N/A","metadata":{"course_id":"ARTH303","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Roman Art and Archaeology","type":"gen_ed"}},{"pageContent":"Medieval Art: Cultural Exchanges in the Byzantine World\nFocuses on the art and architecture from the eastern Mediterranean, specifically, the Byzantine empire. Our broad focus will be on the formation and evolution of the visual arts in Byzantium as a result of exchanges with various cultural, ethnic, and religious entities and traditions. In this context, we will be looking at the legacy of the Graeco-Roman past, contacts with Islamic world, as well as with people and cultures along the periphery of Byzantium: from the Balkan peninsula, to Sicily and Russia.\nAverage GPA: N/A","metadata":{"course_id":"ARTH313","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Medieval Art: Cultural Exchanges in the Byzantine World","type":"gen_ed"}},{"pageContent":"Picturing Contemporary Life: Art Since 1945\nVisual art since 1945, with an emphasis on North America and Europe.\nAverage GPA: N/A","metadata":{"course_id":"ARTH351","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Picturing Contemporary Life: Art Since 1945","type":"gen_ed"}},{"pageContent":"Contemporary Chinese Art and Film\nContemporary Chinese art and film are arguably the most vibrant of all national arts at the turn of the millennium and have become the face - both figuratively and literally - of contemporary China, a complex society with historic overlays of Confucianism, Taoism, Buddhism, Communism, Post-socialism, and state capitalism. Students will consider a wide range of art forms (painting, photography, video, installation, web-based media, and film) in four broad themes (uses of the past; critiques of power; representations of race, gender, and sexuality; socially engaged art) and explore the complex intertwining of the political, historical, and aesthetic aspects in Chinese contemporary art and film, as well as the multiple contexts in which these artworks are created and circulated.\nAverage GPA: N/A","metadata":{"course_id":"ARTH392","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Contemporary Chinese Art and Film","type":"gen_ed"}},{"pageContent":"Introduction to Art Theory\nFundamental concepts of global, philosophic, and critical art theory examined through various historic and contemporary texts, and the analysis of works of art.\nAverage GPA: N/A","metadata":{"course_id":"ARTT150","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Introduction to Art Theory","type":"gen_ed"}},{"pageContent":"Linguistic Landscape of China\nComprehensive introduction to Chinese and other major languages in the Sino-Tibetan, Altaic, Austroasiatic, and Austronesian families, all of which are spoken in China. Taught in English.\nAverage GPA: N/A","metadata":{"course_id":"CHIN307","credits":"3","prerequisites":[],"gen_ed":[["DSHU"]],"name":"Linguistic Landscape of China","type":"gen_ed"}},{"pageContent":"Causes and Consequences of Global Change\nStudy of the major components of Earth's climate system and climate change history. Discussion of 21st century climate change prediction, mitigation and adaptation efforts.\nAverage GPA: N/A","metadata":{"course_id":"AOSC123","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Causes and Consequences of Global Change","type":"gen_ed"}},{"pageContent":"Weather and Climate\nWhat are weather and climate? Most people think they know but if you ask people to explain the differences and similarities you're bound to get a range of answers. Weather affects not just our daily activities but other important aspects of society such as transportation, commerce, security and agriculture. Most people understand what weather is to some extent. Climate and climate change are concepts that evoke strong emotional responses from people but are less well understood. In this class, students examine fundamental issues such as the greenhouse effect, severe weather, and global weather patterns and how they relate to a changing climate. Instruction in the lectures will provide the basic knowledge needed to understand these issues. In the discussion sections, students will be divided into groups to address the implications of these topics through group projects.\nAverage GPA: N/A","metadata":{"course_id":"AOSC200","credits":"3","prerequisites":[],"gen_ed":[["DSNL|AOSC201"],["DSNS","SCIS"]],"name":"Weather and Climate","type":"gen_ed"}},{"pageContent":"Introduction to the Blue Ocean\nThe global ocean is a major component of the Earth System that shapes life on earth, including our weather and climate.  We explore the observation-based interdisciplinary science of oceanography, identifying its strong connections to related sciences like meteorology, and geography.  We apply this developing understanding to environmental issues such as  marine pollution, fish and fisheries, as well as to climate variability and to the changes to the marine environment that are resulting from  steadily rising levels of atmospheric greenhouse gasses.  Focusses  include the biogeochemical and physical changes we can observe in the  nearby Chesapeake Bay and the coastal waters of Eastern Shore,  Maryland.\nAverage GPA: N/A","metadata":{"course_id":"AOSC375","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Introduction to the Blue Ocean","type":"gen_ed"}},{"pageContent":"The Chesapeake Bay Ecosystem: Intersection of Science, Economics, and Policy\nThe Chesapeake Bay is one of the most studied and monitored ecosystems in the world. To develop effective policies to restore this system to a healthier status requires integrating what we know about the biological and physical properties of the system with our understanding of the human dimension. Issues such as achieving nutrient reduction goals, restoring healthy blue crab and oyster fisheries in the bay will be used to demonstrate how economics interacts with science to guide policies that can be effective in achieving Bay restoration goals.\nAverage GPA: N/A","metadata":{"course_id":"AREC200","credits":"3","prerequisites":[],"gen_ed":[["DSNS"],["DSSP","SCIS"]],"name":"The Chesapeake Bay Ecosystem: Intersection of Science, Economics, and Policy","type":"gen_ed"}},{"pageContent":"Introduction to Astronomy\nAn elementary course in descriptive astronomy, especially appropriate for non-science students. Topics include the Sun, Moon, planets, stars, and nebulae, galaxies, and evolution of the Universe.\nAverage GPA: N/A","metadata":{"course_id":"ASTR100","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Introduction to Astronomy","type":"gen_ed"}},{"pageContent":"Introductory Astrophysics - Solar System\nFor students majoring in astronomy or with a strong interest in science. Topics include development of astronomy, planetary orbits, electromagnetic radiation, telescopes as well as constituents and origin of the solar system (planets, satellites, comets, asteroids, meteoroids, etc.).\nAverage GPA: N/A","metadata":{"course_id":"ASTR120","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Introductory Astrophysics - Solar System","type":"gen_ed"}},{"pageContent":"The Science and Fiction of Planetary Systems\nHave you ever wondered if humans will ever terraform Mars or Europa so we could live there without a spacesuit? Has it ever crossed your mind how lucky you are that you live on a water-rich planet with an oxygen-rich atmosphere? Have you ever suspected novelists and scriptwriters of creating ridiculous planets that violate scientific laws? Does the fate of our planet's thin biosphere keep you up at night? How common is life in the Universe? These are difficult questions, but armed with the right information, you can answer all of them. The Science and Fiction of Planetary Systems will help you develop a deeper understanding of why planets are the way they are. Along the way, you'll see examples of mistakes made in classic science fiction movies, novels and short stories and get the chance to invent your own plausible planets!\nAverage GPA: N/A","metadata":{"course_id":"ASTR230","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"The Science and Fiction of Planetary Systems","type":"gen_ed"}},{"pageContent":"Solar System Astronomy\nDesigned primarily for non-science majors. The structure of planets and of their atmospheres, the nature of comets, asteroids, and satellites. Comparison of various theories for the origin of the solar system. Emphasis on a description of recent data and interpretation.\nAverage GPA: N/A","metadata":{"course_id":"ASTR330","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Solar System Astronomy","type":"gen_ed"}},{"pageContent":"Origin of the Universe\nDesigned primarily for non-science majors. A study of our progression of knowledge about the universe. Topics include: early cosmological models, geocentric vs. heliocentric theory, curvature of space, Hubble's Law, Big Bang Theory, microwave background radiation, evolution of stars and galaxies, dark matter, active galaxies, quasars and the future of the universe.\nAverage GPA: N/A","metadata":{"course_id":"ASTR340","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Origin of the Universe","type":"gen_ed"}},{"pageContent":"Black Holes\nBlack holes are the most exotic prediction of Einstein's Theory of General Relativity and, amazingly, the Universe seems to manufacture these bizarre objects in copious numbers.  As well as being the ultimate laboratory for studying the nature of space and time, they drive some of the most energetic and extreme phenomena known to astronomers (with quasars and gamma-ray bursts being just a couple of examples).  In this introduction to the physics and astrophysics of black holes, we start by examining the basic physics of black holes, which fundamentally means understanding gravity.  We then look at the nature of stellar-mass black holes and supermassive black holes.  We will discuss the fairly recent realization that black holes may be crucial agents for regulating the growth of galaxies.  Finally, we dive into the realm of theoretical physics and probe how black holes may provide a route for uncovering new laws of physics governing the structure of space and time.\nAverage GPA: N/A","metadata":{"course_id":"ASTR350","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Black Holes","type":"gen_ed"}},{"pageContent":"Life in the Universe - Astrobiology\nDesigned primarily for non-science majors. Study of the astronomical perspective on the conditions for the origin and existence of life in the universe.\nAverage GPA: N/A","metadata":{"course_id":"ASTR380","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Life in the Universe - Astrobiology","type":"gen_ed"}},{"pageContent":"Beyond Race: Human Biological Diversity\nDo racial labels have any practical use in understanding human biological diversity?  Such categorizations are inextricably linked to racism, including a history of misuse in science going back hundreds of years, yet modern biological research and medicine often include the use of race.  At its core, addressing this question requires understanding the balance between genetic and non-genetic factors underlying human diversity.  The course will help students make an informed critique of the biological basis of race through the study of topics such as: basic biology, data analysis and experimental design, human evolution and genetics, and biomedical research and health outcomes.\nAverage GPA: N/A","metadata":{"course_id":"BSCI151","credits":"3","prerequisites":[],"gen_ed":[["DSNS"],["DSSP","DVUP","SCIS"]],"name":"Beyond Race: Human Biological Diversity","type":"gen_ed"}},{"pageContent":"Principles of Ecology and Evolution\nBasic principles of biology with special emphasis on  ecological and evolutionary biology.\nAverage GPA: N/A","metadata":{"course_id":"BSCI160","credits":"3","prerequisites":[],"gen_ed":[["DSNL|BSCI161"],["DSNS"]],"name":"Principles of Ecology and Evolution","type":"gen_ed"}},{"pageContent":"Principles of Molecular & Cellular Biology\nBasic principles of biology with special emphasis on cellular and molecular biology.\nAverage GPA: N/A","metadata":{"course_id":"BSCI170","credits":"3","prerequisites":[],"gen_ed":[["DSNL|BSCI171"],["DSNS"]],"name":"Principles of Molecular & Cellular Biology","type":"gen_ed"}},{"pageContent":"The Public Microbe\nHow are microbes essential for human health yet cause so much disease? This course covers basic concepts in microbiology as they relate to human- microbe interactions by surveying the diversity of microbial life, the role our resident microbiota play in human health, modes of disease tracking, and prophylactic and therapeutic measures designed to control the spread of infectious disease.\nAverage GPA: N/A","metadata":{"course_id":"BSCI213","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"The Public Microbe","type":"gen_ed"}},{"pageContent":"Understanding The Principles and Perils of CBRN Weapons\nExplores the 'dark side' of scientific applications. Students will gain an understanding of CBRN Weapons, through the exploration of the scientific method, and certain fundamental principles of chemistry, biology, and physics. Students will also learn how to test hypotheses, use basic statistics, interpret results, and apply their new knowledge through discussions of practical applications in the domains of public health, emergency management, epidemiology, and threat assessment. Bringing these fields together in one class will allow students to better understand the use of and threat from CBRN weapons in terrorism.\nAverage GPA: N/A","metadata":{"course_id":"BSST240","credits":"3","prerequisites":[],"gen_ed":[["DSNL|BSST241"],["DSNS"]],"name":"Understanding The Principles and Perils of CBRN Weapons","type":"gen_ed"}},{"pageContent":"Chemistry I - Fundamentals of General Chemistry\nAn overview of the Periodic Table, inorganic substances, ionic and covalent bonding, bulk properties of materials, chemical equilibrium, and quantitative chemistry. CHEM131 is the first course in a four-semester sequence for students majoring in the sciences, other than Chemistry and Biochemistry majors.\nAverage GPA: N/A","metadata":{"course_id":"CHEM131","credits":"3","prerequisites":[],"gen_ed":[["DSNL|CHEM132"],["DSNS"]],"name":"Chemistry I - Fundamentals of General Chemistry","type":"gen_ed"}},{"pageContent":"General Chemistry for Engineers\nThe nature and composition of matter, solutions, chemical reactions, equilibria, and electrochemistry, with applications to various fields of engineering.\nAverage GPA: N/A","metadata":{"course_id":"CHEM135","credits":"3","prerequisites":[],"gen_ed":[["DSNL|CHEM136"],["DSNS"]],"name":"General Chemistry for Engineers","type":"gen_ed"}},{"pageContent":"Principles of General Chemistry\nAn overview of the Periodic Table, inorganic substances, ionic and covalent bonding, bulk properties of materials, chemical equilibrium, and quantitative chemistry. CHEM146 is the first course in a four-semester sequence for Chemistry and Biochemistry majors.\nAverage GPA: N/A","metadata":{"course_id":"CHEM146","credits":"3","prerequisites":[],"gen_ed":[["DSNL|CHEM177"],["DSNS"]],"name":"Principles of General Chemistry","type":"gen_ed"}},{"pageContent":"Introduction to Environmental Science\nOne of two required courses that introduce students to the topics studied and methods employed in environmental science and policy. Emphasis on scientific ways of knowing; the systems, cycles, flows, and interfaces that characterize the atmosphere, lithosphere, hydrosphere, and biosphere; the analysis of human impacts on these systems; and the nature of scientific uncertainty and methods of quantifying environmental processes.\nAverage GPA: N/A","metadata":{"course_id":"ENSP101","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Introduction to Environmental Science","type":"gen_ed"}},{"pageContent":"Bats in Society: Human-Wildlife Relationships, Conflicts, & Solutions\nHow might an understanding of human-wildlife conflicts shape our approach to disease, ecology, and conservation? Should we care that we are losing wildlife, like bats? Across the globe, human societies have significantly harmed bat populations both intentionally and unintentionally. This course will delve into different bat population crisis causes as well as current and potential solutions, while addressing complex human-wildlife conflicts that need to be considered while solving them. During the course, students will get hands-on experience using highly sophisticated bat acoustic technology to identify bats to species-level. Lecture and discussion sections will focus on bat ecology, management techniques, newest bat identification techniques, data interpretation, and scientific presentation skills.\nAverage GPA: N/A","metadata":{"course_id":"ENST115","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Bats in Society: Human-Wildlife Relationships, Conflicts, & Solutions","type":"gen_ed"}},{"pageContent":"Introduction to Environmental Health\nExamines how humans are affected by the quality of our air, water, soil and food supply as well as how human activities alter these survival necessities.  Students will learn how the evolution and prosperity of human populations have resulted in degradation of our environment and the impact of environmental degradation on the health of people.  The implications of individual and collective choices for sustainable food production, population management, and resource utilization will be explored.\nAverage GPA: N/A","metadata":{"course_id":"ENST233","credits":"4","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Introduction to Environmental Health","type":"gen_ed"}},{"pageContent":"Natural Disasters: Earthquakes, Floods, and Fires\nCatastrophic Environmental Events (CCE) that are becoming more common in this time of global environmental change and it is essential that today's students be equipped with the knowledge and skills to be leaders as we, as a society, understand the upheaval that these CCEs are causing. Students will examine how CEEs shape human society and ecosystem from the interdisciplinary perspective afforded by the field of Geography. Students will use the latest geographic science concepts and techniques in exploring these events. Using satellite imagery they will gain a multi-scale perspective of the ecological and societal aspects of the events.\nAverage GPA: N/A","metadata":{"course_id":"GEOG140","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Natural Disasters: Earthquakes, Floods, and Fires","type":"gen_ed"}},{"pageContent":"Mapping our Digital World\nIntroduction to technical methods used in gathering, analyzing, and mapping geospatial information for applications such as urban mobility, environmental monitoring, situational awareness, and disaster management. Topics include Geographic Information Systems (GIS), cartography, map projections, satellite and airborne remote sensing, the global positioning system (GPS), and introductory statistics and probability. The course is a gateway to more advanced technical classes in geospatial science.\nAverage GPA: N/A","metadata":{"course_id":"GEOG170","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Mapping our Digital World","type":"gen_ed"}},{"pageContent":"Earth From Space\nEarth observations from space enable the mapping and monitoring of our changing planet.  This survey course reviews current observational capabilities and examines scientific applications in quantifying global environmental change. Drivers and outcomes of key dynamics will be illustrated and discussed, including sea and continental ice loss, deforestation, ocean warming, urbanization, agricultural expansion and intensification, and vegetation response to climate change.\nAverage GPA: N/A","metadata":{"course_id":"GEOG172","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Earth From Space","type":"gen_ed"}},{"pageContent":"Physical Geology\nA general survey of the rocks and minerals composing the earth, its surface features and the agents that form them, and the dynamic forces of plate tectonics.\nAverage GPA: N/A","metadata":{"course_id":"GEOL100","credits":"3","prerequisites":[],"gen_ed":[["DSNL|GEOL110"],["DSNS"]],"name":"Physical Geology","type":"gen_ed"}},{"pageContent":"Dinosaurs: A Natural History\nDinosaurs, their evolution, and our understanding of their fossil record. Students will examine the geologic record and the tools used by paleontologists to determine: geologic ages and ancient environments; evolutionary history and extinctions; dinosaurian biology and behavior; and their survival as birds. Mechanisms of global change ranging from plate tectonics to asteroid impact will be discussed.\nAverage GPA: N/A","metadata":{"course_id":"GEOL104","credits":"3","prerequisites":[],"gen_ed":[["DSNS"]],"name":"Dinosaurs: A Natural History","type":"gen_ed"}},{"pageContent":"Environmental Geology\nA review of geologic factors underlying many environmental problems and the interactions between population and physical environment: geologic hazards, land-use planning, conservation, mineral resources, waste disposal, land reclamation, and the geologic aspects of health and disease. The course is aimed at lower division students in education and liberal arts, and should be useful to any student concerned with geologic perspectives of environmental problems.\nAverage GPA: N/A","metadata":{"course_id":"GEOL120","credits":"3","prerequisites":[],"gen_ed":[["DSNL|GEOL110"],["DSNS"]],"name":"Environmental Geology","type":"gen_ed"}},{"pageContent":"Causes and Consequences of Global Change\nStudy of the major components of Earth's climate system and climate change history. Discussion of 21st century climate change prediction, mitigation and adaptation efforts.\nAverage GPA: N/A","metadata":{"course_id":"GEOL123","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Causes and Consequences of Global Change","type":"gen_ed"}},{"pageContent":"Earth's Fury: Earthquakes, Volcanoes, and Tsunami\nEarthquakes, volcanic eruptions, and tsunami frequently remind us of the dangers associated with living on a constantly changing planet. How do people prepare for these rare but dramatic events? Student will study the science behind earthquakes and volcanoes, how it guides monitoring, forecasting, prevention, and response, and the cultural and ethical aspects of these events.\nAverage GPA: N/A","metadata":{"course_id":"GEOL200","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Earth's Fury: Earthquakes, Volcanoes, and Tsunami","type":"gen_ed"}},{"pageContent":"Introduction to Ecological and Evolutionary Anthropology\nAn introduction to the evolution of human physiology and human behavior, the relationship between hominid and non-hominid primates, and the study of relationships between a population of humans and their biophysical environment.\nAverage GPA: N/A","metadata":{"course_id":"ANTH222","credits":"4","prerequisites":[],"gen_ed":[["DSNL","DVUP"]],"name":"Introduction to Ecological and Evolutionary Anthropology","type":"gen_ed"}},{"pageContent":"Weather and Climate\nWhat are weather and climate? Most people think they know but if you ask people to explain the differences and similarities you're bound to get a range of answers. Weather affects not just our daily activities but other important aspects of society such as transportation, commerce, security and agriculture. Most people understand what weather is to some extent. Climate and climate change are concepts that evoke strong emotional responses from people but are less well understood. In this class, students examine fundamental issues such as the greenhouse effect, severe weather, and global weather patterns and how they relate to a changing climate. Instruction in the lectures will provide the basic knowledge needed to understand these issues. In the discussion sections, students will be divided into groups to address the implications of these topics through group projects.\nAverage GPA: N/A","metadata":{"course_id":"AOSC200","credits":"3","prerequisites":[],"gen_ed":[["DSNL|AOSC201"],["DSNS","SCIS"]],"name":"Weather and Climate","type":"gen_ed"}},{"pageContent":"General Astronomy\nDescriptive astronomy, appropriate for non-science majors. Sun, moon, planets, stars, nebulae, galaxies and evolution. Laboratory exercises include use of photographic material, computer simulations, and standard laboratory equipment.\nAverage GPA: N/A","metadata":{"course_id":"ASTR101","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"General Astronomy","type":"gen_ed"}},{"pageContent":"Amazing Green: Plants that Transformed the World\nIn what profound ways have plants changed humanity and the world we live in today? An interactive way to learn about plants and science, focusing on how plants have changed human history, the biology of their growth, and the science behind their use.\nAverage GPA: N/A","metadata":{"course_id":"BSCI135","credits":"4","prerequisites":[],"gen_ed":[["DSNL","SCIS"]],"name":"Amazing Green: Plants that Transformed the World","type":"gen_ed"}},{"pageContent":"Principles of Ecology and Evolution\nBasic principles of biology with special emphasis on  ecological and evolutionary biology.\nAverage GPA: N/A","metadata":{"course_id":"BSCI160","credits":"3","prerequisites":[],"gen_ed":[["DSNL|BSCI161"],["DSNS"]],"name":"Principles of Ecology and Evolution","type":"gen_ed"}},{"pageContent":"Principles of Molecular & Cellular Biology\nBasic principles of biology with special emphasis on cellular and molecular biology.\nAverage GPA: N/A","metadata":{"course_id":"BSCI170","credits":"3","prerequisites":[],"gen_ed":[["DSNL|BSCI171"],["DSNS"]],"name":"Principles of Molecular & Cellular Biology","type":"gen_ed"}},{"pageContent":"Human Anatomy and Physiology I\nAnatomy and physiology of the skeletal, muscular, neural, endocrine, and sensory systems. Course not acceptable toward major requirements in Biological Sciences, Chemistry or Biochemistry.\nAverage GPA: N/A","metadata":{"course_id":"BSCI201","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Human Anatomy and Physiology I","type":"gen_ed"}},{"pageContent":"General Microbiology\nHow have microorganisms exploited every conceivable ecological niche, and how have humans harnessed this diversity to improve medicine, agriculture, and biotechnology? The course covers fundamental concepts in morphology, physiology, genetics, immunology, ecology, and pathogenic microbiology. Applications of microbiology to medicine, the food industry, and biotechnology.\nAverage GPA: N/A","metadata":{"course_id":"BSCI223","credits":"4","prerequisites":[],"gen_ed":[["DSNL","SCIS"]],"name":"General Microbiology","type":"gen_ed"}},{"pageContent":"Understanding The Principles and Perils of CBRN Weapons\nExplores the 'dark side' of scientific applications. Students will gain an understanding of CBRN Weapons, through the exploration of the scientific method, and certain fundamental principles of chemistry, biology, and physics. Students will also learn how to test hypotheses, use basic statistics, interpret results, and apply their new knowledge through discussions of practical applications in the domains of public health, emergency management, epidemiology, and threat assessment. Bringing these fields together in one class will allow students to better understand the use of and threat from CBRN weapons in terrorism.\nAverage GPA: N/A","metadata":{"course_id":"BSST240","credits":"3","prerequisites":[],"gen_ed":[["DSNL|BSST241"],["DSNS"]],"name":"Understanding The Principles and Perils of CBRN Weapons","type":"gen_ed"}},{"pageContent":"Chemistry I - Fundamentals of General Chemistry\nAn overview of the Periodic Table, inorganic substances, ionic and covalent bonding, bulk properties of materials, chemical equilibrium, and quantitative chemistry. CHEM131 is the first course in a four-semester sequence for students majoring in the sciences, other than Chemistry and Biochemistry majors.\nAverage GPA: N/A","metadata":{"course_id":"CHEM131","credits":"3","prerequisites":[],"gen_ed":[["DSNL|CHEM132"],["DSNS"]],"name":"Chemistry I - Fundamentals of General Chemistry","type":"gen_ed"}},{"pageContent":"General Chemistry for Engineers\nThe nature and composition of matter, solutions, chemical reactions, equilibria, and electrochemistry, with applications to various fields of engineering.\nAverage GPA: N/A","metadata":{"course_id":"CHEM135","credits":"3","prerequisites":[],"gen_ed":[["DSNL|CHEM136"],["DSNS"]],"name":"General Chemistry for Engineers","type":"gen_ed"}},{"pageContent":"Principles of General Chemistry\nAn overview of the Periodic Table, inorganic substances, ionic and covalent bonding, bulk properties of materials, chemical equilibrium, and quantitative chemistry. CHEM146 is the first course in a four-semester sequence for Chemistry and Biochemistry majors.\nAverage GPA: N/A","metadata":{"course_id":"CHEM146","credits":"3","prerequisites":[],"gen_ed":[["DSNL|CHEM177"],["DSNS"]],"name":"Principles of General Chemistry","type":"gen_ed"}},{"pageContent":"Fundamentals of Soil Science\nStudy and management of soils as natural bodies, media for plant growth, and ecosystem components. Morphology, composition, formation, and conservation of soils. Chemical, biological, and physical properties are discussed in relation to the production of plants, the functioning of hydrologic and nutrient cycles, the protection of environmental quality, and engineering uses of soils.\nAverage GPA: N/A","metadata":{"course_id":"ENST200","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Fundamentals of Soil Science","type":"gen_ed"}},{"pageContent":"Geography of Environmental Systems\nA systematic introduction to the processes and associated forms of the atmosphere and earth's surfaces emphasizing the interaction between climatology, hydrology and geomorphology.\nAverage GPA: N/A","metadata":{"course_id":"GEOG201","credits":"3","prerequisites":[],"gen_ed":[["DSNL|GEOG211"]],"name":"Geography of Environmental Systems","type":"gen_ed"}},{"pageContent":"Physical Geology\nA general survey of the rocks and minerals composing the earth, its surface features and the agents that form them, and the dynamic forces of plate tectonics.\nAverage GPA: N/A","metadata":{"course_id":"GEOL100","credits":"3","prerequisites":[],"gen_ed":[["DSNL|GEOL110"],["DSNS"]],"name":"Physical Geology","type":"gen_ed"}},{"pageContent":"Environmental Geology\nA review of geologic factors underlying many environmental problems and the interactions between population and physical environment: geologic hazards, land-use planning, conservation, mineral resources, waste disposal, land reclamation, and the geologic aspects of health and disease. The course is aimed at lower division students in education and liberal arts, and should be useful to any student concerned with geologic perspectives of environmental problems.\nAverage GPA: N/A","metadata":{"course_id":"GEOL120","credits":"3","prerequisites":[],"gen_ed":[["DSNL|GEOL110"],["DSNS"]],"name":"Environmental Geology","type":"gen_ed"}},{"pageContent":"Introduction to Plant Science\nA general introduction to plant science designed to provide the students with a working knowledge of the fundamental structures and processes of plants. Content includes plant anatomy, physiology, genetics and environmental relationships.\nAverage GPA: N/A","metadata":{"course_id":"INAG100","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Introduction to Plant Science","type":"gen_ed"}},{"pageContent":"Physics of Music\nA study of the physical basis of sound, acoustical properties of sound, the human ear and voice, reproduction of sound, electronic music, acoustical properties of auditoriums, and other selected topics.\nAverage GPA: N/A","metadata":{"course_id":"PHYS102","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS103"]],"name":"Physics of Music","type":"gen_ed"}},{"pageContent":"Inquiry into Physics\nIntended for students majoring in neither the physical nor the biological sciences. Use of laboratory-based and inquiry-based methods to study some of the basic ideas of physical sciences.\nAverage GPA: N/A","metadata":{"course_id":"PHYS115","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Inquiry into Physics","type":"gen_ed"}},{"pageContent":"Fundamentals of Physics I\nThe first part of a two-semester course in general physics treating the fields of mechanics, heat, sound, electricity, magnetism, optics, and modern physics. Together with PHYS122, this generally satisfies the minimum requirement of medical and dental schools.\nAverage GPA: N/A","metadata":{"course_id":"PHYS121","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Fundamentals of Physics I","type":"gen_ed"}},{"pageContent":"Fundamentals of Physics II\nA continuation of PHYS121, which together with it, generally satisfies the minimum requirement of medical and dental schools.\nAverage GPA: N/A","metadata":{"course_id":"PHYS122","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Fundamentals of Physics II","type":"gen_ed"}},{"pageContent":"General Physics: Mechanics and Particle Dynamics\nFirst semester of a three-semester calculus-based general physics course. Laws of motion, force, and energy; principles of mechanics, collisions, linear momentum, rotation, and gravitation.\nAverage GPA: N/A","metadata":{"course_id":"PHYS161","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS275"],["DSNS"]],"name":"General Physics: Mechanics and Particle Dynamics","type":"gen_ed"}},{"pageContent":"Introductory Physics: Mechanics\nFirst semester of a three semester sequence for physics majors and those desiring a rigorous preparation in the physical sciences: kinematics, Newton's laws, energy and work, linear and angular momenta.\nAverage GPA: N/A","metadata":{"course_id":"PHYS171","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS275"],["DSNS"]],"name":"Introductory Physics: Mechanics","type":"gen_ed"}},{"pageContent":"Introductory Physics: Mechanics\nFirst semester of a three semester sequence for physics majors and those desiring a rigorous preparation in the physical sciences: kinematics, Newton's laws, energy and work, linear and angular momenta.\nAverage GPA: N/A","metadata":{"course_id":"PHYS171H","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS275"],["DSNS"]],"name":"Introductory Physics: Mechanics","type":"gen_ed"}},{"pageContent":"General Physics: Electricity, Magnetism and Thermodynamics\nSecond semester of a three-semester calculus-based general physics course. Electrostatics, magnetism, induction, DC and AC circuits; Maxwell's Equations, heat, and thermodynamics.\nAverage GPA: N/A","metadata":{"course_id":"PHYS260","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS261"]],"name":"General Physics: Electricity, Magnetism and Thermodynamics","type":"gen_ed"}},{"pageContent":"General Physics: Electricity, Magnetism and Thermodynamics\nSecond semester of a three-semester calculus-based general physics course. Electrostatics, magnetism, induction, DC and AC circuits; Maxwell's Equations, heat, and thermodynamics.\nAverage GPA: N/A","metadata":{"course_id":"PHYS260H","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS261"]],"name":"General Physics: Electricity, Magnetism and Thermodynamics","type":"gen_ed"}},{"pageContent":"General Physics: Waves, Optics, Relativity and Modern Physics\nThird semester of a three-semester calculus-based general physics course. Waves, sound, electromagnetic waves, optics, special theory of relativity, and modern physics.\nAverage GPA: N/A","metadata":{"course_id":"PHYS270","credits":"3","prerequisites":[],"gen_ed":[["DSNL|PHYS271"]],"name":"General Physics: Waves, Optics, Relativity and Modern Physics","type":"gen_ed"}},{"pageContent":"Introduction to Turf Science and Management\nPrincipals of turf science and culture with emphasis on turfgrass anatomy, morphology, and physiology. The role of cultural interventions in achieving specific aesthetic and functional objectives is examined for multiple turf uses. Pest problems typically encountered in turfgrass management are also covered.\nAverage GPA: N/A","metadata":{"course_id":"PLSC205","credits":"4","prerequisites":[],"gen_ed":[["DSNL"]],"name":"Introduction to Turf Science and Management","type":"gen_ed"}},{"pageContent":"Asian Americans and Media\nFrom yellow peril invaders to model minority allies, Asian Americans have crafted their own dynamic cultural expressions in a number of media from film, television, and music to fashion, sports, and food that reveal and contest the contradictions of the U.S. nation-state. Asian American culture also uniquely sits at the nexus of immigration flows and digital technologies, providing a transnational lens to view the US place in the world. This advanced course, then, will introduce students to the study and practice of Asian American cyktyre as multiple , hybrid, and heterogeneous. It will do so through three sections: section one will introduce students to classical, cultural, and media concepts as well as relevant keywords outlined by Asian American Studies scholars; section two will review the work of Asian American cultural theorists; section three will focus on analyses of particular Asian American cultural productions. In doing so, students will gain an understanding of the shifting and interlocking tensions among the local, the national, and the global that form the cultural geographies of Asian America.\nAverage GPA: N/A","metadata":{"course_id":"AAST351","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVUP"]],"name":"Asian Americans and Media","type":"gen_ed"}},{"pageContent":"(Dis)ability in American Film\nExplores the connection between film and disability through an analysis of independent and mainstream American films in various film genres. Specifically, we will consider how these film representations reflect and/or challenge the shifting social perspectives of disability over the 20th and 21st centuries.  Beginning with the presentation of disability as theatrical spectacle in the traveling sideshow and early cinema, we will work our way through film history to develop an understanding of our society's complicated relationship with disability.\nAverage GPA: N/A","metadata":{"course_id":"AMST320","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP","DVUP"]],"name":"(Dis)ability in American Film","type":"gen_ed"}},{"pageContent":"Introduction to Aquaculture\nIntroduces the art and science of rearing aquatic animals and the essential principles of aquaculture. Students receive hands-on training in the methods required for successful husbandry and management of aquatic animals in their water environment.\nAverage GPA: N/A","metadata":{"course_id":"ANSC255","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Introduction to Aquaculture","type":"gen_ed"}},{"pageContent":"Internship Experience in Animal and Avian Sciences\n\nAverage GPA: N/A","metadata":{"course_id":"ANSC359","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Internship Experience in Animal and Avian Sciences","type":"gen_ed"}},{"pageContent":"Method & Theory in Medical Anthropology and Global Health\nProvides a critical perspective to global health that encompasses key political, economic, and cultural factors associated with the nature and magnitude of global health issues such as HIV/AIDS, tuberculosis and malaria, paying particular attention to how poverty and inequalities within and between societies has accelerated current global health challenges. Introduces students to how medical anthropologists have contributed to the debates surrounding the globalization of health.\nAverage GPA: N/A","metadata":{"course_id":"ANTH310","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVUP"]],"name":"Method & Theory in Medical Anthropology and Global Health","type":"gen_ed"}},{"pageContent":"Environmental Archaeology\nAn overview of modern environmental archaeology as a tool for the interdisciplinary investigation of past and present global change and to engage the long term past with current issues of sustainability and rapid environmental change.\nAverage GPA: N/A","metadata":{"course_id":"ANTH451","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Environmental Archaeology","type":"gen_ed"}},{"pageContent":"Anthropology of Cultural Heritage\nA global exploration of how the past is remade in the present. Covers the breadth of scope and specific interventions of heritage practice at the global scale, including the social, political, economic, and ethical dimensions of cultural heritage.\nAverage GPA: N/A","metadata":{"course_id":"ANTH464","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Anthropology of Cultural Heritage","type":"gen_ed"}},{"pageContent":"Design Thinking and Making in Architecture\nExamines iterative design processes and critical thinking skills through active learning and design thinking methodologies to solve problems and apply design as a lens of inquiry and exploration. Students will understand Design Thinking through interactive and experiential learning.\nAverage GPA: N/A","metadata":{"course_id":"ARCH171","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Design Thinking and Making in Architecture","type":"gen_ed"}},{"pageContent":"Design in Practice\nCase studies and hands-on design projects ranging in scale from a product to a building to give students insight into the process by which architects work both individually and collaboratively to put disciplinary knowledge and expertise into practice to shape our built environment.\nAverage GPA: N/A","metadata":{"course_id":"ARCH270","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Design in Practice","type":"gen_ed"}},{"pageContent":"People, Planet, and Profit: Building Sustainable Places\nAn introduction to the four disciplines represented in the School: architecture and urban design, community planning, historic preservation, and real estate development, that work to create a more sustainable environment for the future to create a more sustainable environment for the future using our interpretation of the quadruple bottom line: socio-cultural, economic, environmental, and design sustainability. Students will be provided with an understanding of the fundamental scholarship and processes of each of these disciplines and examine the intersections between them. Additionally, they will learn by applying the approaches of the four disciplines through a series of field studies.\nAverage GPA: N/A","metadata":{"course_id":"ARCH271","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"People, Planet, and Profit: Building Sustainable Places","type":"gen_ed"}},{"pageContent":"The Chesapeake Bay Ecosystem: Intersection of Science, Economics, and Policy\nThe Chesapeake Bay is one of the most studied and monitored ecosystems in the world. To develop effective policies to restore this system to a healthier status requires integrating what we know about the biological and physical properties of the system with our understanding of the human dimension. Issues such as achieving nutrient reduction goals, restoring healthy blue crab and oyster fisheries in the bay will be used to demonstrate how economics interacts with science to guide policies that can be effective in achieving Bay restoration goals.\nAverage GPA: N/A","metadata":{"course_id":"AREC200","credits":"3","prerequisites":[],"gen_ed":[["DSNS"],["DSSP","SCIS"]],"name":"The Chesapeake Bay Ecosystem: Intersection of Science, Economics, and Policy","type":"gen_ed"}},{"pageContent":"Harvesting Big Data to Examine Agriculture and Climate Change\nCan agricultural production keep up with climate change? The digital revolution has changed the way we analyze and interpret the world. Big data offers both opportunities and challenges that require new tools and methods of analysis. This course applies sophisticated digital tools to an age-old concern: the impact of climate on agricultural productivity. In this hands-on introduction to data analysis and visualization with real-world data, students acquire the tools to understand the impacts of environmental change and more.\nAverage GPA: N/A","metadata":{"course_id":"AREC280","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Harvesting Big Data to Examine Agriculture and Climate Change","type":"gen_ed"}},{"pageContent":"Farm Management and Sustainable Food Production\nThe organization and operation of farm businesses are explored through principles of management, financial analysis, production economics, marketing, and business planning. These farm management principles are presented in the context of a sustainable food production system.\nAverage GPA: N/A","metadata":{"course_id":"AREC306","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Farm Management and Sustainable Food Production","type":"gen_ed"}},{"pageContent":"Explorations in Arts and Humanities; Mapping Biographies of the Enslaved in America\nfirst semester first year students in the College of Arts and Humanities. This course engages students in first-hand archival, historical, and digital work on the history of enslavement in America so that we might better understand its long-reaching effects. Students will work with public databases and biographical materials in an effort to recover what we can of the histories of the enslaved and the industries of enslavement. Though this course takes a broad approach to American slavery, we will also pay special attention to the history of slavery in Maryland.\nAverage GPA: N/A","metadata":{"course_id":"ARHU158D","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Explorations in Arts and Humanities; Mapping Biographies of the Enslaved in America","type":"gen_ed"}},{"pageContent":"Explorations in Arts and Humanities; From Parasite to Mutualist: Redesigning Human Relations with Earth\nfirst semester first year students in the College of Arts and Humanities. How can human societies shift from parasitic to mutualistic environmental behaviors? This interdisciplinary course examines paths to solve our great challenges: climate change and habitat degradation caused by fossil fuels and rampant consumer culture. Themes include evolutionary mutualism, group selection, permaculture, Indigenous knowledge, post-petroculture, closed loops, and zero waste. These mutualisms reveal how humanist subjects like identity, culture, narrative, and environmental injustice affect our relationship with Earth. Creative assignments and guest speakers will inform in-depth projects that redesign parasitisms to be mutualisms in green infrastructure, sustainable agriculture, greenwashing, environmental psychology and sociology, and creative \"righting.\"\nAverage GPA: N/A","metadata":{"course_id":"ARHU158K","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Explorations in Arts and Humanities; From Parasite to Mutualist: Redesigning Human Relations with Earth","type":"gen_ed"}},{"pageContent":"Explorations in Arts and Humanities; Theatre as a Tool for Societal Transformation\nfirst semester first year students in the College of Arts and Humanities. Because theatre is a live, character-driven art form, it is uniquely situated to encourage audience members and collaborators to put themselves in someone else's shoes and empathetically engage with different backgrounds and perspectives. Theatre can be a powerful tool to wrestle with the great societal and political challenges of our times, and pave the way for societal transformation. Through field trips to see productions at DC-area professional theatres, guest artist visits, play analysis and creative projects, students will gain firsthand knowledge of the creative roles in theatre, including the contributions and processes of a director, designer, actor, and playwright.\nAverage GPA: N/A","metadata":{"course_id":"ARHU158M","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Explorations in Arts and Humanities; Theatre as a Tool for Societal Transformation","type":"gen_ed"}},{"pageContent":"Explorations in Arts and Humanities; The Art of Public Health\nfirst semester first year students in the College of Arts and Humanities. Artists explore and document public health disparities by collectively creating a multiverse of expression. Public health offers a technical framework to address the challenges faced in the United States and beyond. Artists, over the ages, have expanded our understanding of health inequities through advocacy and giving voice to the experiences of marginalized communities. Through literature, film, music and visual art, students will explore the power and essentiality of the humanities in public health.\nAverage GPA: N/A","metadata":{"course_id":"ARHU158N","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Explorations in Arts and Humanities; The Art of Public Health","type":"gen_ed"}},{"pageContent":"Explorations in Arts and Humanities; The Power of Youth\nfirst semester first year students in the College of Arts and Humanities. 20-something influencers such as Kylie Jenner and Shawn Mendes use social media to reach their millions of followers and to help shape what they think about, talk about, and purchase. Former Parkland, Florida student David Hogg shows how young people can affect social change by advocating for stricter gun control laws on national media outlets. Starting with these examples and drawing from literature, politics, and gender and sexuality studies, we will analyze youth and its power in our culture.\nAverage GPA: N/A","metadata":{"course_id":"ARHU158Q","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Explorations in Arts and Humanities; The Power of Youth","type":"gen_ed"}},{"pageContent":"Explorations in Arts and Humanities; Language and Antiracism\nfirst semester first year students in the College of Arts and Humanities. This sociolinguistics seminar is addressed to incoming ARHU majors, particularly those seeking a degree that will allow them to teach any language (including both L1 and L2) at any educational level. It is anchored in a critical interdisciplinary approach -- sociolinguistics, applied linguistics, Hispanic applied linguistics, linguistic anthropology, sociology, social psychology, race studies, Latinx studies, language acquisition, education, Hip-Hop studies -- that emphasizes the social, political and ideological dimensions of language. Its objective is to raise linguistic awareness through the implementation of antiracist language teaching methods in the language classroom.\nAverage GPA: N/A","metadata":{"course_id":"ARHU158W","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Explorations in Arts and Humanities; Language and Antiracism","type":"gen_ed"}},{"pageContent":"Writing for the Stage and Screen: An Introductory Workshop\nIntroduction to the theory and practice of scriptwriting with an opportunity to read, view, evaluate, write, and revise texts meant to be performed. Students will practice writing for the stage, film, and television and also examine selected scripts, performances, and film and television clips as models for their own creative work. Students will complete frequent writing exercises, participate in workshops, and learn to apply scholarship to the analysis and critique of scripts.\nAverage GPA: N/A","metadata":{"course_id":"ARHU275","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writing for the Stage and Screen: An Introductory Workshop","type":"gen_ed"}},{"pageContent":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Prose\nJimenez-Porter Writers' House students.\nAverage GPA: N/A","metadata":{"course_id":"ARHU319A","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Prose","type":"gen_ed"}},{"pageContent":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Exploring the Contemporary Revolution in Poetic Practice\nJimenez-Porter Writers' House students.\nAverage GPA: N/A","metadata":{"course_id":"ARHU319D","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Exploring the Contemporary Revolution in Poetic Practice","type":"gen_ed"}},{"pageContent":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Criminal Intent: The Craft of Crime Fiction\nJimenez-Porter Writers' House students. This workshop delves into the craft of crime fiction, from noir and hardboiled detectives to psychological thrillers and literary crime. Students will explore plotting, suspense, moral ambiguity, and character psychology while developing their own stories. Through readings, discussions, and exercises, we'll examine how crime fiction reflects societal anxieties, justice, and corruption. Authors like Tod Goldberg, Tana French, Vu Tran, Ivy Pochoda, Juliet Grames, Lauren Groff, Hector Acostaand S.A. Cosby will guide our study. Students will workshop original crime fiction, refining prose and deepening narratives. By semester's end, they will complete a polished crime story, gaining insight into crime fiction's artistic and social impact.\nAverage GPA: N/A","metadata":{"course_id":"ARHU319E","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Writers' House Second Year Colloquium: Form and Theory of Creative Writing; Criminal Intent: The Craft of Crime Fiction","type":"gen_ed"}},{"pageContent":"Arts Entrepreneurship and the Creative Profession\nIntroduces students to arts entrepreneurship in preparation for diverse and ever-changing careers in the creative fields. Students will practice and develop their entrepreneurial mindsets and learn about different frameworks for audience engagement. Topics include financial management, revenue development, business planning, and the \"need-to-knows\" of the gig economy. Throughout the semester, students will have the opportunity to learn from a variety of entrepreneurs in the arts and to evaluate their future career paths.\nAverage GPA: N/A","metadata":{"course_id":"ARHU340","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Arts Entrepreneurship and the Creative Profession","type":"gen_ed"}},{"pageContent":"The TV Writers Room Screenwriting for Television and Video\nStudents engage with the theory and practice of screenwriting for television and video. Students read and watch teleplays designed to teach advantages of the television format. Students apply what they learn to prepare frequent writing exercises, share and provide feedback for peers scripts in a workshop format, and work together as a Writers Room to prepare an original pilot episode.\nAverage GPA: N/A","metadata":{"course_id":"ARHU375","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"The TV Writers Room Screenwriting for Television and Video","type":"gen_ed"}},{"pageContent":"Experiential Learning\nPrerequisite: Permission of ARHU-College of Arts & Humanities. Restriction: Junior standing or higher.\nAverage GPA: N/A","metadata":{"course_id":"ARHU386","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Experiential Learning","type":"gen_ed"}},{"pageContent":"Public Art\nHow does public art function on a university campus, in major cities, and across the United States? This course invites students to empirically study the modern history and civic values of public art spanning sculpture, painting, mixed-media, and installation. We consider the nature of public space, the politics of representation and community, and the civic and memorial functions of art. The course is built around a semester-long project in which students will commission a work of public art for our College Park campus.\nAverage GPA: N/A","metadata":{"course_id":"ARTH262","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP"]],"name":"Public Art","type":"gen_ed"}},{"pageContent":"Experiential Learning\nSupervised internship experience in diverse areas of art historical, archaeological, and museological work.\nAverage GPA: N/A","metadata":{"course_id":"ARTH386","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Experiential Learning","type":"gen_ed"}},{"pageContent":"Two-Dimensional Design Fundamentals\nPrinciples and elements of two-dimensional design. Introduction to visual communication.\nAverage GPA: N/A","metadata":{"course_id":"ARTT100","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Two-Dimensional Design Fundamentals","type":"gen_ed"}},{"pageContent":"Elements of Drawing I\nFundamental concepts, media, and processes of drawing. Emphasis on observation and representation in combination with individual expression. Subject matter includes still life, human figure, nature, the built environment, and conceptual projects.\nAverage GPA: N/A","metadata":{"course_id":"ARTT110","credits":"3","prerequisites":[],"gen_ed":[["DSSP"]],"name":"Elements of Drawing I","type":"gen_ed"}},{"pageContent":"Growing Up Asian American: The Asian Immigrant Family and the Second Generation\nAn interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.\nAverage GPA: N/A","metadata":{"course_id":"AAST394","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Growing Up Asian American: The Asian Immigrant Family and the Second Generation","type":"gen_ed"}},{"pageContent":"Growing Up Asian American: The Asian Immigrant Family and the Second Generation\nAn interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.\nAverage GPA: N/A","metadata":{"course_id":"AMST324","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Growing Up Asian American: The Asian Immigrant Family and the Second Generation","type":"gen_ed"}},{"pageContent":"Changing Climate, Changing Cultures\nExplore past, present, and future interactions between humans and climate. Discussions, methods-oriented activities, and case study analyses provide students a foundation for appreciating the role of anthropology in understanding, responding to, and preparing for climate change.\nAverage GPA: N/A","metadata":{"course_id":"ANTH266","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC","SCIS"]],"name":"Changing Climate, Changing Cultures","type":"gen_ed"}},{"pageContent":"Innovations in Countering Violent Extremism\nIntroduces students to novel innovations in the development of Countering Violent Extremism (CVE) programs. CVE is a realm of policy, programs, and interventions designed to prevent individuals from engaging in violence associated with radical political, social, cultural, and/or religious ideologies. Unlike counterterrorism strategies that often focus on targeting and disrupting terrorist plots, CVE focuses on radicalization prevention through engagement and intervention with communities. CVE also focuses on deradicalization and rehabilitation of former extremists. Throughout the course, students will work in groups to develop their own innovative CVE programs, rather than merely learn about CVE through lectures.\nAverage GPA: N/A","metadata":{"course_id":"BSST335","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Innovations in Countering Violent Extremism","type":"gen_ed"}},{"pageContent":"Intermediate Written Chinese I\nReading and writing skills with emphasis on grammar and Chinese characters.\nAverage GPA: N/A","metadata":{"course_id":"CHIN202","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Intermediate Written Chinese I","type":"gen_ed"}},{"pageContent":"Common Ground Deliberative Dialogues; Civic Engagement for Social Good\nStudents will explore current societal issues through an intergroup, deliberative dialogue model. The course includes foundations of dialogue, identity reflection, peer leadership, engagement across differences, and dialogic skill-building.\nAverage GPA: N/A","metadata":{"course_id":"CHSE228C","credits":"1","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Common Ground Deliberative Dialogues; Civic Engagement for Social Good","type":"gen_ed"}},{"pageContent":"Common Ground Deliberative Dialogues; Common Ground ResLife\n\nAverage GPA: N/A","metadata":{"course_id":"CHSE228D","credits":"1","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Common Ground Deliberative Dialogues; Common Ground ResLife","type":"gen_ed"}},{"pageContent":"Fundamentals of Sign Language\nReceptive and expressive skills in American Sign Language. Examination of the causes of deafness, characteristics of deaf education, and aspects of the culture of the deaf community.\nAverage GPA: N/A","metadata":{"course_id":"CHSE376","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Fundamentals of Sign Language","type":"gen_ed"}},{"pageContent":"Essentials of Intercultural Communication\nIntroduction of major theories and concepts of intercultural communication; examination of processes that make up cultural differences; and use of intercultural communication competence skills.\nAverage GPA: N/A","metadata":{"course_id":"COMM382","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Essentials of Intercultural Communication","type":"gen_ed"}},{"pageContent":"College Park Scholars: Public Leadership First-Year Colloquium I\nIntroductory colloquium: Examination of issues related to public leadership.\nAverage GPA: N/A","metadata":{"course_id":"CPPL100","credits":"1","prerequisites":[],"gen_ed":[["DVCC"]],"name":"College Park Scholars: Public Leadership First-Year Colloquium I","type":"gen_ed"}},{"pageContent":"The Future of Communicating Science\nHow can scientists communicate their work effectively? The field of science communication ventures that the answer is not simply a matter of improving capacity (e.g., because people lack scientific information, scientists lack communication skills, or both). Rather, it calls for sustained collaboration and empathy between laypersons and experts. In this hands-on, experiential course, we use a model of cultural competency to put forth solutions to bridge the expert-lay divide. We investigate typical venues in which science is communicated (museums, YouTube videos, federal agency websites, and much much more) and study best practices for communication. Then we explore emerging venues that support sustained contact between so-called \"lay citizens\" and scientific or technical experts (dance/improv techniques, ethnographic methods and citizen science). Students learn to use cross-cultural perspectives as a basis to pilot and test ways of strengthening relationships and improving communication.\nAverage GPA: N/A","metadata":{"course_id":"CPSS220","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"The Future of Communicating Science","type":"gen_ed"}},{"pageContent":"Disability in Community: Access, Accommodation, and Adaptation\nExamines the concept of disability in a variety of community settings. Drawing on classic and contemporary readings in psychology, sociology and special education, the course will couple conceptual and historical understanding of disability with first-hand service-learning experiences in the community. Students will develop a plan in several phases that encompasses principles of Universal Design for Living/Learning (UDL) to study and participate in community-based activities.\nAverage GPA: N/A","metadata":{"course_id":"EDSP220","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVCC"]],"name":"Disability in Community: Access, Accommodation, and Adaptation","type":"gen_ed"}},{"pageContent":"Equity and Inclusion in Engineering Design\nJames Clark School of Engineering or in the Global Engineering Leadership minor.   Through deliberate reflections on the past and current patterns of exclusion and inclusion within engineering, you will develop skills for engaging in equitable and inclusive processes and practices that can transform your collaborations and approach to engineering and the design process. This course engages students, from multiple social identity groups, in facilitated dialogue that focus on the tensions, similarities, and differences of experience that exist within, between, and/or across groups.\nAverage GPA: N/A","metadata":{"course_id":"ENES138","credits":"1","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Equity and Inclusion in Engineering Design","type":"gen_ed"}},{"pageContent":"Virtus Living and Learning Community Seminar III\nThe seminar focuses on personal, academic and professional success by cultivating leadership skills, developing academic and technical ability and encouraging self awareness, identifying and employing strategies for academic and professional success, further enhancing career development through networking and mentoring and developing awareness of diversity issues.\nAverage GPA: N/A","metadata":{"course_id":"ENES213","credits":"1","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Virtus Living and Learning Community Seminar III","type":"gen_ed"}},{"pageContent":"FLEXUS Living and Learning Community Seminar III\nThe seminar focuses on personal, academic and professional success by cultivating leadership skills, developing self-confidence and self-efficacy in academic and technical ability and encouraging self awareness, identifying and employing strategies for academic and professional success, further enhancing career development through networking, mentoring and role modeling, and developing awareness of diversity issues, specifically gender diversity.\nAverage GPA: N/A","metadata":{"course_id":"ENES215","credits":"1","prerequisites":[],"gen_ed":[["DVCC"]],"name":"FLEXUS Living and Learning Community Seminar III","type":"gen_ed"}},{"pageContent":"Leading Global Teams and Engaging Across Cultures in Business, Engineering, and Technology\nDevelop global leadership capacities and an understanding of the cultural aspects pertaining to industry and international business. In a globalized world, the ability to work, lead and communicate in culturally diverse settings has become a core component to leadership. Through real-world examples, research, and simulations, students will increase their self-awareness and understanding of culture and how culture influences attitudes, behaviors, and practices at the individual, organizational, or societal levels. Students will develop the skills necessary to navigate, negotiate, and lead cross-cultural engagements and teams. The course content is relevant and applicable to anyone interested in developing cross-cultural leadership competencies and cultivating a global mindset.\nAverage GPA: N/A","metadata":{"course_id":"ENES472","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Leading Global Teams and Engaging Across Cultures in Business, Engineering, and Technology","type":"gen_ed"}},{"pageContent":"Families and Global Health\nStudents will explore, define, and study global health, social determinants of health, health inequalities, gender inequality, family violence, and maternal and child health using a global perspective.\nAverage GPA: N/A","metadata":{"course_id":"FMSC110","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC"]],"name":"Families and Global Health","type":"gen_ed"}},{"pageContent":"Families and Global Health\nStudents will explore, define, and study global health, social determinants of health, health inequalities, gender inequality, family violence, and maternal and child health using a global perspective.\nAverage GPA: N/A","metadata":{"course_id":"FMSC110S","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC"]],"name":"Families and Global Health","type":"gen_ed"}},{"pageContent":"Introduction to Human Geography\nIntroduction to what geographers do and how they do it. Systematic study of issues regarding social and cultural systems from a global to a local scale. Looks at the distribution of these variables and answers the question \"Why here, and not there\"?\nAverage GPA: N/A","metadata":{"course_id":"GEOG202","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC"]],"name":"Introduction to Human Geography","type":"gen_ed"}},{"pageContent":"Capstone in International Development\nServes as one of the two capstone courses for the Minor in International Development and Conflict Management. Focuses on advanced theory and the practice and profession of international development and is designed to provide students an introduction to, and a chance to engage with, a core set of practical skills relevant to the field.\nAverage GPA: N/A","metadata":{"course_id":"GVPT356","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVCC"]],"name":"Capstone in International Development","type":"gen_ed"}},{"pageContent":"Leadership and Ethnicity\nExamines the concept of leadership from the standpoint of race, ethnicity, and culture. Specifically, we will explore the concept and differing meanings of leader and leadership within racial/ethnic communities in the United States. Issues of leaders and leadership will be examined as influenced by political, cultural, and historic events. The course will place particular emphasis on colleges and universities as a microcosm of the larger society and as a cultural site for exploring and assessing issues of race, ethnicity, diversity and leadership.\nAverage GPA: N/A","metadata":{"course_id":"HESI423","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Leadership and Ethnicity","type":"gen_ed"}},{"pageContent":"Leadership and the Jewish Community\nOffers students the opportunity to critically examine leadership and leadership identity development in relation to Jewish culture and identity. Explores how Jewish culture and ethnicity influence leadership styles and the role that leadership has played within Jewish history. Students will explore general leadership theories as well as personal leadership identity development in both an overall sense and as a member of the Jewish community. Examines leaders within the Jewish movement and how their leadership has influenced Jewish communities and explores issues facing the Jewish community both on college campuses and in the world and prepare student leaders to act as advocates for the Jewish community.\nAverage GPA: N/A","metadata":{"course_id":"HESI424","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Leadership and the Jewish Community","type":"gen_ed"}},{"pageContent":"Global Health Messages: Understanding Exposure & Impact\nUsing a global perspective, this course teaches students to be critical consumers of current and historical health communication interventions. It also provides students with the skills to develop media interventions that target specific and general populations. Students will discover the array of diverse media messages that influence the health and well-being of individuals and communities.\nAverage GPA: N/A","metadata":{"course_id":"HLTH234","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC","SCIS"]],"name":"Global Health Messages: Understanding Exposure & Impact","type":"gen_ed"}},{"pageContent":"Global Health Messages: Understanding Exposure & Impact\nUsing a global perspective, this course teaches students to be critical consumers of current and historical health communication interventions. It also provides students with the skills to develop media interventions that target specific and general populations. Students will discover the array of diverse media messages that influence the health and well-being of individuals and communities.\nAverage GPA: N/A","metadata":{"course_id":"HLTH234H","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC","SCIS"]],"name":"Global Health Messages: Understanding Exposure & Impact","type":"gen_ed"}},{"pageContent":"Growing Up Asian American: The Asian Immigrant Family and the Second Generation\nAn interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.\nAverage GPA: N/A","metadata":{"course_id":"IMMR394","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Growing Up Asian American: The Asian Immigrant Family and the Second Generation","type":"gen_ed"}},{"pageContent":"Technology, Culture, and Society\nIndividual, cultural, and societal outcomes associated with development of information & communication technologies (ICTs), including pro- and anti-social factors. Unpacking how gender, race, ethnicity, sexual orientation, disabilities, and political affiliations affect consumption and production of online experiences. Unpacking how structures of dominance, power and privilege manifest at individual, institutional and cultural levels.\nAverage GPA: N/A","metadata":{"course_id":"INST466","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Technology, Culture, and Society","type":"gen_ed"}},{"pageContent":"LGBTQ+ Public Speaking and Facilitation\nGuides students through oral communication skills around LGBTQ+ topics. The course centers the experiences of minoritized intersectional LGBTQ+ communities, and students will use speaking, presentation, and facilitation skills to educate the UMD community about sexual orientation and gender identity and expression through panel discussions in classes, residence halls, and other university settings. Students who have received training for this purpose enter into these discussions prepared to disseminate accurate information, to answer questions that students, staff, and faculty may have about the realities of LGBTQ+ lives. Students will receive training that is rooted in queer theory and social justice education, building on the prerequisite course LGBT 200.\nAverage GPA: N/A","metadata":{"course_id":"LGBT350","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVCC"]],"name":"LGBTQ+ Public Speaking and Facilitation","type":"gen_ed"}},{"pageContent":"Lesbian, Gay, Bisexual, and Transgender Community Organization Internship\nSupervised internship experience with a community organization that expressly serves lesbian, gay, bisexual, and transgender people. Students will be expected to relate course material to experience in an analysis of an organization's activities.\nAverage GPA: N/A","metadata":{"course_id":"LGBT386","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVCC"]],"name":"Lesbian, Gay, Bisexual, and Transgender Community Organization Internship","type":"gen_ed"}},{"pageContent":"Peer Education: Preventing Power-Based Violence\nDesigned to train students to become Peer Educators who are responsible for presenting to members of the campus community about the complex dynamics surrounding issues of power-based personal violence. This includes: sexual assault, relationship violence, stalking, bystander intervention, consent, and rape culture. Students fully learn the on and off-campus resources for victim/survivors. Programming is done in classroom settings, residence halls, Greek life spaces, and at tables during special events.\nAverage GPA: N/A","metadata":{"course_id":"PEER312","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Peer Education: Preventing Power-Based Violence","type":"gen_ed"}},{"pageContent":"Examining Pluralism in Public Policy\nUnderstanding pluralism and how groups and individuals coexist in society is an essential part of the public policy process. This course will examine the ways in which the diverse experiences of race, gender, ethnicity, class, orientation, identity, and religion impact the understanding of and equitable delivery of public policy. The examination of how identity development shapes our understanding of society and influences the decision-making process is central to students' shaping policy that is truly for the people. This course will equip students with the skills needed to analyze pluralism and draw conclusions about the application of various theories to public policy issues.\nAverage GPA: N/A","metadata":{"course_id":"PLCY302","credits":"3","prerequisites":[],"gen_ed":[["DVCC"]],"name":"Examining Pluralism in Public Policy","type":"gen_ed"}},{"pageContent":"Introduction to African American and Africana Studies\nSignificant aspects of the history of African Americans with particular emphasis on the evolution and development of black communities from slavery to the present. Interdisciplinary introduction to social, political, legal and economic roots of contemporary problems faced by blacks in the United States with applications to the lives of other racial and ethnic minorities in the Americas and in other societies.\nAverage GPA: N/A","metadata":{"course_id":"AAAS100","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to African American and Africana Studies","type":"gen_ed"}},{"pageContent":"The New Jim Crow: African-Americans, Mass Incarceration and the Prison Industrial Complex\nStudents will examine the birth of the racial caste system following the abolition of slavery, the parallels between the racial hierarchy of the Jim Crow system and contemporary mass incarceration, and the rise of the prison industrial complex as a multi-billon business which thrives on the oppression of low-income populations and poor communities of color.\nAverage GPA: N/A","metadata":{"course_id":"AAAS187","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"The New Jim Crow: African-Americans, Mass Incarceration and the Prison Industrial Complex","type":"gen_ed"}},{"pageContent":"Black Culture in the United States\nThe course examines important aspects of African American life and thought which are reflected in African American literature, drama, music and art. Beginning with the cultural heritage of slavery, the course surveys the changing modes of Black creative expression from the 19th-century to the present.\nAverage GPA: N/A","metadata":{"course_id":"AAAS202","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Black Culture in the United States","type":"gen_ed"}},{"pageContent":"Get Out: The Sunken Place of Race Relations in the Post-Racial Era\nPrevailing thought suggests that we live in an era that is post-racial, particularly after the election of Barack Obama. Media often serves to drive our assessment of where our nation stands on issues like race, gender and sexuality. This course uses the film Get Out to delve into the production, evolution and significance of race in present day America. The course will engage multiple forms of media to investigate life in \"Post-Racial\" America, including but not limited to the role of stereotypes, interracial relationships, police-community relations, etc.\nAverage GPA: N/A","metadata":{"course_id":"AAAS211","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Get Out: The Sunken Place of Race Relations in the Post-Racial Era","type":"gen_ed"}},{"pageContent":"Social (In)Justice and African-American Health and Well-Being\nAfrican Americans suffer worse outcomes than non-Hispanic whites on nearly every health measure and outcomes that link to overall well-being like depressive symptoms or homicides. Health disparities are experienced by other underrepresented minority groups, but because of the unique historic and current experiences of African Americans, the determinants and solutions to African American health disparities are unique. The premise of this course is that African American health disparities are due to social injustices perpetuated on the institutional level that have permeated the lived experiences of African Americans leading to racial disparities in health and well-being. As such, the solutions on the both policy, and community, level must have a social justice approach.\nAverage GPA: N/A","metadata":{"course_id":"AAAS230","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Social (In)Justice and African-American Health and Well-Being","type":"gen_ed"}},{"pageContent":"African-American Literature and Culture\nAn exploration of the stories black authors tell about themselves, their communities, and the nation as informed by time and place, gender, sexuality, and class. African American perspective themes such as art, childhood, sexuality, marriage, alienation and mortality, as well as representations of slavery, Reconstruction, racial violence and the Nadir, legalized racism and segregation, black patriotism and black ex-patriots, the optimism of integration, and the prospects of a post-racial America.\nAverage GPA: N/A","metadata":{"course_id":"AAAS234","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"African-American Literature and Culture","type":"gen_ed"}},{"pageContent":"African-American History to 1865\nSurvey of the principal developments in the history and culture of the peoples of African descent in colonial North America and the United States to 1865. Examines the African past, the Atlantic slave trade, variation in slavery, the growth of free black communities, the transformations of families and cultural forms, and patterns of resistance.\nAverage GPA: N/A","metadata":{"course_id":"AAAS254","credits":"3","prerequisites":[],"gen_ed":[["DVUP"]],"name":"African-American History to 1865","type":"gen_ed"}},{"pageContent":"Directed Readings in African American and Africana Studies\nThe readings will be directed by the faculty of African American Studies. Topics to be covered will be chosen to meet the needs and interests of individual students.\nAverage GPA: N/A","metadata":{"course_id":"AAAS400","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Directed Readings in African American and Africana Studies","type":"gen_ed"}},{"pageContent":"Introduction to Asian American Studies\nThe aggregate experience of Asian Pacific Americans, from developments in the countries of origin to their contemporary issues. The histories of Asian Pacific American groups as well as culture, politics, the media, and stereotypes, viewed from an interdisciplinary perspective.\nAverage GPA: N/A","metadata":{"course_id":"AAST200","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Asian American Studies","type":"gen_ed"}},{"pageContent":"Immigration and Ethnicity in the US\nExplores historical and contemporary Asian immigration to the US in comparison to and in the context of other immigrant groups. From low-skilled laborers to highly-skilled professionals, Asian and other immigrants have been an integral part of the shifting US economy and society since its inception. The course includes theories on why immigration occurs, determinants of its continuation, the uses of migrant labor, and immigrant adaptation and settlement. The second part of the course focuses on theories of ethnicity and racial formation and how immigrants develop and challenge the definitions of race, ethnicity, the \"other\", and ultimately, who is American. Students will also have the opportunity to gain first-hand knowledge of the immigrant experience through a life history interview project.\nAverage GPA: N/A","metadata":{"course_id":"AAST322","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Immigration and Ethnicity in the US","type":"gen_ed"}},{"pageContent":"Asian Americans and Media\nFrom yellow peril invaders to model minority allies, Asian Americans have crafted their own dynamic cultural expressions in a number of media from film, television, and music to fashion, sports, and food that reveal and contest the contradictions of the U.S. nation-state. Asian American culture also uniquely sits at the nexus of immigration flows and digital technologies, providing a transnational lens to view the US place in the world. This advanced course, then, will introduce students to the study and practice of Asian American cyktyre as multiple , hybrid, and heterogeneous. It will do so through three sections: section one will introduce students to classical, cultural, and media concepts as well as relevant keywords outlined by Asian American Studies scholars; section two will review the work of Asian American cultural theorists; section three will focus on analyses of particular Asian American cultural productions. In doing so, students will gain an understanding of the shifting and interlocking tensions among the local, the national, and the global that form the cultural geographies of Asian America.\nAverage GPA: N/A","metadata":{"course_id":"AAST351","credits":"3","prerequisites":[],"gen_ed":[["DSSP","DVUP"]],"name":"Asian Americans and Media","type":"gen_ed"}},{"pageContent":"Asian Americans in Film\nExplores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.\nAverage GPA: N/A","metadata":{"course_id":"AAST355","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Asian Americans in Film","type":"gen_ed"}},{"pageContent":"Filipino American History and Biography\nFocus is placed on Filipino American experiences with an emphasis on identity, community building and organizing to influence public policy We will cover pertinent events from the US and Philippine history in order to understand the impact of colonialism, migration, immigration and assimilation on Filipino Americans.\nAverage GPA: N/A","metadata":{"course_id":"AAST363","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Filipino American History and Biography","type":"gen_ed"}},{"pageContent":"South Asian American Literature and Culture\nExamines writing by South Asian American authors and authors writing about South Asian American issues. It explores major South Asian diaspora themes, considering how migration, war, the events of 9/11, global capitalism, and the changing socio-political and racial scene have affected South Asians in the United States. We will use a transnational approach to consider how writers and filmmakers explore gender, class, religious, caste, and other differences amongst South Asian Americans. We will also examine the place of South Asian Americans in relation to other Asian American populations. We will consider how South Asian American texts disrupt traditional literary classifications based on national identities by reflecting the complex global conditions, imperialistic and capitalistic expansion, and interconnectedness of peoples, nations, and cultures that have transformed American literature and conceptions of American identity.\nAverage GPA: N/A","metadata":{"course_id":"AAST440","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"South Asian American Literature and Culture","type":"gen_ed"}},{"pageContent":"Asian American Politics\nStudents will gain a greater understanding of 1) the role of Asian Americans in US politics, 2) the political attitudes and behaviors of Asian Americans and 3) how to conduct research on Asian American politics. Though the class will concentrate on Asian Americans, issues related to Asian American politics will be examined within the larger context of America's multicultural political landscape.\nAverage GPA: N/A","metadata":{"course_id":"AAST443","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Asian American Politics","type":"gen_ed"}},{"pageContent":"Introduction to Anti-Black Racism\nThis interdisciplinary course seeks to provide a broad overview of this rich and dynamic history. Built around the expertise of top UMD faculty in five colleges, this course will introduce students to the history and legacy of anti-Black racism from the perspective of multiple disciplines. In this course you will examine the development, spread, and articulations of anti-Black racism in the United States.\nAverage GPA: N/A","metadata":{"course_id":"ABRM330","credits":"3","prerequisites":[],"gen_ed":[["DVUP"]],"name":"Introduction to Anti-Black Racism","type":"gen_ed"}},{"pageContent":"Introduction American Studies\nIntroduces students to the interdisciplinary field of American Studies by examining concepts such as culture, identity, cultural practices, and globalization, as well as theories underlying these concepts. Engages key themes, especially constructions of difference and identity, cultures of everyday life, and America and the world.\nAverage GPA: N/A","metadata":{"course_id":"AMST101","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Introduction American Studies","type":"gen_ed"}},{"pageContent":"Popular Culture in America\nAn introduction to American popular culture, its historical development, and its role as a reflection of and influence on our culture and society.\nAverage GPA: N/A","metadata":{"course_id":"AMST203","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Popular Culture in America","type":"gen_ed"}},{"pageContent":"Film and American Culture Studies\nExploration of the American film from a historical perspective, illustrating the motion picture's role as an institutional phenomenon, as a form of communication, and as a source of cross-cultural study.\nAverage GPA: N/A","metadata":{"course_id":"AMST204","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Film and American Culture Studies","type":"gen_ed"}},{"pageContent":"American Material Culture: The Study of People, Places, and Things\nHistorical survey of American material culture. Ways of describing and interpreting accumulated material evidence (e.g., buildings, town plans) introduced by stressing relationship between artifact and culture.\nAverage GPA: N/A","metadata":{"course_id":"AMST205","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"American Material Culture: The Study of People, Places, and Things","type":"gen_ed"}},{"pageContent":"Introduction to Asian American Studies\nThe aggregate experience of Asian Pacific Americans, from developments in the countries of origin to their contemporary issues. The histories of Asian Pacific American groups as well as culture, politics, the media, and stereotypes, viewed from an interdisciplinary perspective.\nAverage GPA: N/A","metadata":{"course_id":"AMST298C","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Asian American Studies","type":"gen_ed"}},{"pageContent":"U.S. Latinx Literature and Culture\nExamines the poetry, prose, and theater of Latinx communities in the United States from their origins in the Spanish colonization of North America to their ongoing development in the 21st century. Considers how authors use literary form to gain insight into human experience, including mortality, religious belief, gender and sexuality, war and peace, family, language use, scientific inquiry, cultural tradition, ecology, and labor. Also studies how Latinx literary traditions have shaped and been shaped by broader currents in American literature, as well as what connections exist between Latinx literature and social and artistic developments in other parts of the world, particularly Latin America and the Caribbean. Authors may include Alvar Nunez Cabeza de Vaca, Eulalia Perez, Juan Nepomuceno Seguin, Maria Amparo Ruiz de Burton, Jose Marti, Arthur A. Schomburg, Jesus Colon, Julia de Burgos, Cesar Chavez, Ariel Dorfman, Gloria Anzaldua, Junot Diaz, and Cristina Garcia.\nAverage GPA: N/A","metadata":{"course_id":"AMST298Q","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"U.S. Latinx Literature and Culture","type":"gen_ed"}},{"pageContent":"(Dis)ability in American Film\nExplores the connection between film and disability through an analysis of independent and mainstream American films in various film genres. Specifically, we will consider how these film representations reflect and/or challenge the shifting social perspectives of disability over the 20th and 21st centuries.  Beginning with the presentation of disability as theatrical spectacle in the traveling sideshow and early cinema, we will work our way through film history to develop an understanding of our society's complicated relationship with disability.\nAverage GPA: N/A","metadata":{"course_id":"AMST320","credits":"3","prerequisites":[],"gen_ed":[["DSHU"],["DSSP","DVUP"]],"name":"(Dis)ability in American Film","type":"gen_ed"}},{"pageContent":"Filipino American History and Biography\nFocus is placed on Filipino American experiences with an emphasis on identity, community building and organizing to influence public policy We will cover pertinent events from the US and Philippine history in order to understand the impact of colonialism, migration, immigration and assimilation on Filipino Americans.\nAverage GPA: N/A","metadata":{"course_id":"AMST323","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Filipino American History and Biography","type":"gen_ed"}},{"pageContent":"Asian Americans in Film\nExplores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.\nAverage GPA: N/A","metadata":{"course_id":"AMST328W","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP"]],"name":"Asian Americans in Film","type":"gen_ed"}},{"pageContent":"Asian American Politics\nStudents will gain a greater understanding of 1) the role of Asian Americans in US politics, 2) the political attitudes and behaviors of Asian Americans and 3) how to conduct research on Asian American politics. Though the class will concentrate on Asian Americans, issues related to Asian American politics will be examined within the larger context of America's multicultural political landscape.\nAverage GPA: N/A","metadata":{"course_id":"AMST498J","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Asian American Politics","type":"gen_ed"}},{"pageContent":"Introduction to Medical Anthropology and Global Health\nAn introduction to the central concepts in medical anthropology and the anthropology of global health. This course is a survey of anthropological notions of health, disease, and the body in cross-cultural and global contexts, including classic and contemporary texts. It will provide an examination of systems of knowledge and practice with regard to illness, healing, and global health inequities.\nAverage GPA: N/A","metadata":{"course_id":"ANTH210","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Medical Anthropology and Global Health","type":"gen_ed"}},{"pageContent":"Introduction to Ecological and Evolutionary Anthropology\nAn introduction to the evolution of human physiology and human behavior, the relationship between hominid and non-hominid primates, and the study of relationships between a population of humans and their biophysical environment.\nAverage GPA: N/A","metadata":{"course_id":"ANTH222","credits":"4","prerequisites":[],"gen_ed":[["DSNL","DVUP"]],"name":"Introduction to Ecological and Evolutionary Anthropology","type":"gen_ed"}},{"pageContent":"Introduction to Archaeology\nExploration of the variety of past human societies and cultures through archaeology, from the emergence of anatomically modern humans to the more recent historical past.\nAverage GPA: N/A","metadata":{"course_id":"ANTH240","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Archaeology","type":"gen_ed"}},{"pageContent":"Introduction to Sociocultural Anthropology and Linguistics\nCulture and social relationships in a wide variety of settings from small-scale to complex societies. An overview of how anthropology analyzes human behavior. Particular attention to the relationship between language and culture.\nAverage GPA: N/A","metadata":{"course_id":"ANTH260","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP"]],"name":"Introduction to Sociocultural Anthropology and Linguistics","type":"gen_ed"}},{"pageContent":"The New Jim Crow: African-Americans, Mass Incarceration and the Prison Industrial Complex\nStudents will examine the birth of the racial caste system following the abolition of slavery, the parallels between the racial hierarchy of the Jim Crow system and contemporary mass incarceration, and the rise of the prison industrial complex as a multi-billon business which thrives on the oppression of low-income populations and poor communities of color.\nAverage GPA: N/A","metadata":{"course_id":"AAAS187","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"The New Jim Crow: African-Americans, Mass Incarceration and the Prison Industrial Complex","type":"gen_ed"}},{"pageContent":"Get Out: The Sunken Place of Race Relations in the Post-Racial Era\nPrevailing thought suggests that we live in an era that is post-racial, particularly after the election of Barack Obama. Media often serves to drive our assessment of where our nation stands on issues like race, gender and sexuality. This course uses the film Get Out to delve into the production, evolution and significance of race in present day America. The course will engage multiple forms of media to investigate life in \"Post-Racial\" America, including but not limited to the role of stereotypes, interracial relationships, police-community relations, etc.\nAverage GPA: N/A","metadata":{"course_id":"AAAS211","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Get Out: The Sunken Place of Race Relations in the Post-Racial Era","type":"gen_ed"}},{"pageContent":"Social (In)Justice and African-American Health and Well-Being\nAfrican Americans suffer worse outcomes than non-Hispanic whites on nearly every health measure and outcomes that link to overall well-being like depressive symptoms or homicides. Health disparities are experienced by other underrepresented minority groups, but because of the unique historic and current experiences of African Americans, the determinants and solutions to African American health disparities are unique. The premise of this course is that African American health disparities are due to social injustices perpetuated on the institutional level that have permeated the lived experiences of African Americans leading to racial disparities in health and well-being. As such, the solutions on the both policy, and community, level must have a social justice approach.\nAverage GPA: N/A","metadata":{"course_id":"AAAS230","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Social (In)Justice and African-American Health and Well-Being","type":"gen_ed"}},{"pageContent":"Did Yeast Create Civilization?\nDid yeast create civilization?  Fermented foods have played a major role in the transition from nomadic to settled agrarian societies, the establishment of social and religious customs, the expansion of empires, and modern economies. To what extent are our past and current attitudes towards fermented foods rooted in historical and cultural imprints? Explore the central role of fermentation in human history and culture, the basic microbiological processes underlying fermentation processes, and the processes used to produce and distribute fermented foods. Find out how the fruits, grains, and dairy products used to produce fermented foods are grown and selected. Students will learn about the development and modern use of fermented dairy products, pickles, bread, tea, chocolate, wine, beer, distilled liquors, and pharmaceutical/manufactured products.\nAverage GPA: N/A","metadata":{"course_id":"AGST130","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"Did Yeast Create Civilization?","type":"gen_ed"}},{"pageContent":"American Culture in the Information Age\nExamines the ways in which content and form of public information interact with the culture, families & individuals.\nAverage GPA: N/A","metadata":{"course_id":"AMST260","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"American Culture in the Information Age","type":"gen_ed"}},{"pageContent":"Anthropology of Global Health\nAn overview of the growing field of global health including health care systems, medical practices, ideas about illness in cross-cultural contexts, issues of health development, global health inequity, and human rights issues. The course will focus on the history of global health, the critique of major international health agencies and their development paradigms, and the political economy of social inequalities and health.\nAverage GPA: N/A","metadata":{"course_id":"ANTH265","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"Anthropology of Global Health","type":"gen_ed"}},{"pageContent":"Changing Climate, Changing Cultures\nExplore past, present, and future interactions between humans and climate. Discussions, methods-oriented activities, and case study analyses provide students a foundation for appreciating the role of anthropology in understanding, responding to, and preparing for climate change.\nAverage GPA: N/A","metadata":{"course_id":"ANTH266","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVCC","SCIS"]],"name":"Changing Climate, Changing Cultures","type":"gen_ed"}},{"pageContent":"Plagues, Pathogens and Public Policy\nThe impact of diseases on populations from prehistoric times through the present will be examined, along with public perceptions of disease, scientific breakthroughs on treatment and prevention, and the ways that politics and public health policies can enhance or impede the advancement of disease treatment. The natural history of disease, population structure, and immunity will be discussed. The class will address emerging and re-emerging diseases and the ways that first responders, researchers, and policy makers may affect the outcome of an outbreak.\nAverage GPA: N/A","metadata":{"course_id":"ANTH323","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"Plagues, Pathogens and Public Policy","type":"gen_ed"}},{"pageContent":"Causes and Consequences of Global Change\nStudy of the major components of Earth's climate system and climate change history. Discussion of 21st century climate change prediction, mitigation and adaptation efforts.\nAverage GPA: N/A","metadata":{"course_id":"AOSC123","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"Causes and Consequences of Global Change","type":"gen_ed"}},{"pageContent":"Weather and Climate\nWhat are weather and climate? Most people think they know but if you ask people to explain the differences and similarities you're bound to get a range of answers. Weather affects not just our daily activities but other important aspects of society such as transportation, commerce, security and agriculture. Most people understand what weather is to some extent. Climate and climate change are concepts that evoke strong emotional responses from people but are less well understood. In this class, students examine fundamental issues such as the greenhouse effect, severe weather, and global weather patterns and how they relate to a changing climate. Instruction in the lectures will provide the basic knowledge needed to understand these issues. In the discussion sections, students will be divided into groups to address the implications of these topics through group projects.\nAverage GPA: N/A","metadata":{"course_id":"AOSC200","credits":"3","prerequisites":[],"gen_ed":[["DSNL|AOSC201"],["DSNS","SCIS"]],"name":"Weather and Climate","type":"gen_ed"}},{"pageContent":"Design in Practice\nCase studies and hands-on design projects ranging in scale from a product to a building to give students insight into the process by which architects work both individually and collaboratively to put disciplinary knowledge and expertise into practice to shape our built environment.\nAverage GPA: N/A","metadata":{"course_id":"ARCH270","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Design in Practice","type":"gen_ed"}},{"pageContent":"The Chesapeake Bay Ecosystem: Intersection of Science, Economics, and Policy\nThe Chesapeake Bay is one of the most studied and monitored ecosystems in the world. To develop effective policies to restore this system to a healthier status requires integrating what we know about the biological and physical properties of the system with our understanding of the human dimension. Issues such as achieving nutrient reduction goals, restoring healthy blue crab and oyster fisheries in the bay will be used to demonstrate how economics interacts with science to guide policies that can be effective in achieving Bay restoration goals.\nAverage GPA: N/A","metadata":{"course_id":"AREC200","credits":"3","prerequisites":[],"gen_ed":[["DSNS"],["DSSP","SCIS"]],"name":"The Chesapeake Bay Ecosystem: Intersection of Science, Economics, and Policy","type":"gen_ed"}},{"pageContent":"The Science of Gender in Economics and Development\nIs science an objective enterprise that qualifies researchers to investigate gender free from the constraints and prejudice of their culture? We will investigate the process by which various scientific disciplines, including anthropology, evolutionary biology, psychology, and economics do research on the topic of gender. We will describe the current state of the literature on why different sexes exist and how sex translates into gender across different societies today. With a better understanding of the sources of sex and gender, we will examine how to research the reasons behind the highly divergent economic outcomes for men and women today. We will discuss these issues in the context of the labor market in developed countries like the US as well as a variety of contexts in developing countri es. A particular focus will be the techniques for learning more about the underlying reasons for these differences, how and whether they can be overcome, and if women play a specific role in improving economic outcomes in the poorest parts of the world.\nAverage GPA: N/A","metadata":{"course_id":"AREC260","credits":"3","prerequisites":[],"gen_ed":[["DSHS","DVUP","SCIS"]],"name":"The Science of Gender in Economics and Development","type":"gen_ed"}},{"pageContent":"Harvesting Big Data to Examine Agriculture and Climate Change\nCan agricultural production keep up with climate change? The digital revolution has changed the way we analyze and interpret the world. Big data offers both opportunities and challenges that require new tools and methods of analysis. This course applies sophisticated digital tools to an age-old concern: the impact of climate on agricultural productivity. In this hands-on introduction to data analysis and visualization with real-world data, students acquire the tools to understand the impacts of environmental change and more.\nAverage GPA: N/A","metadata":{"course_id":"AREC280","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Harvesting Big Data to Examine Agriculture and Climate Change","type":"gen_ed"}},{"pageContent":"Monuments, Monumentality, and the Art of Memorial\nWhy do societies create monuments? And why do they preserve and destroy, change and remove them? How do monuments embody cultural values, shape historical narratives, and become sites of mourning and memory? This course investigates the political and cultural work of monuments across time and space, from the ancient world to European empires to the contemporary United States. The issues we consider include intercultural exchange and religious contexts, race and representation, and appropriation and iconoclasm.\nAverage GPA: N/A","metadata":{"course_id":"ARTH261","credits":"3","prerequisites":[],"gen_ed":[["DSHU","DVUP","SCIS"]],"name":"Monuments, Monumentality, and the Art of Memorial","type":"gen_ed"}},{"pageContent":"How (and Why) to Look at Art in the Era of Climate Change\nHow can art help us build the mindset necessary for fashioning a sustainable civilization? Paintings, photographs, films, novels, songs, and other creative works as they shape beliefs related to sustainability and justice.\nAverage GPA: N/A","metadata":{"course_id":"ARTH265","credits":"3","prerequisites":[],"gen_ed":[["DSHU","SCIS"]],"name":"How (and Why) to Look at Art in the Era of Climate Change","type":"gen_ed"}},{"pageContent":"The Science and Fiction of Planetary Systems\nHave you ever wondered if humans will ever terraform Mars or Europa so we could live there without a spacesuit? Has it ever crossed your mind how lucky you are that you live on a water-rich planet with an oxygen-rich atmosphere? Have you ever suspected novelists and scriptwriters of creating ridiculous planets that violate scientific laws? Does the fate of our planet's thin biosphere keep you up at night? How common is life in the Universe? These are difficult questions, but armed with the right information, you can answer all of them. The Science and Fiction of Planetary Systems will help you develop a deeper understanding of why planets are the way they are. Along the way, you'll see examples of mistakes made in classic science fiction movies, novels and short stories and get the chance to invent your own plausible planets!\nAverage GPA: N/A","metadata":{"course_id":"ASTR230","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"The Science and Fiction of Planetary Systems","type":"gen_ed"}},{"pageContent":"Creative Problem Solving\nExamines the concept of creative problem solving as it applies in today's and tomorrow's complex business environment. Students will develop an understanding of the creative problem solving process with its distinctive cognitive steps of Divergent Thinking, Emergent Thinking and Convergent Thinking.  Topics include creativity techniques for groups and individuals, creativity as a foundation to recognize business opportunities and develop innovative products and services, selecting ideas and making them stick, mental and organizational obstacles to creativity as well as an overview of electronic tools to increase creative capability.\nAverage GPA: N/A","metadata":{"course_id":"BMGT161","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Creative Problem Solving","type":"gen_ed"}},{"pageContent":"Ethics of Artificial Intelligence\nWhat ethical considerations should govern the creation, distribution, and use of artificial intelligence innovations in industry, polity, and society in the future?  New and emerging innovations in artificial intelligence (AI) are disrupting sectors as diverse as healthcare, medicine, finance, operations, supply chain, manufacturing, media and journalism, and the creative industries.  In the near future, the dependence of humans on AI for a myriad of social activities including companionship and care is also expected to accelerate.  This course deals with the question of how we should ensure AI will create ethical economic and social systems that reflect the kind of world we want to live in 20 to 30 years from now. The values and ethics of society will influence and govern how AI can either contribute to humanity or lead to a dystrophic future.\nAverage GPA: N/A","metadata":{"course_id":"BMGT207","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Ethics of Artificial Intelligence","type":"gen_ed"}},{"pageContent":"The Enterprising Leader\nDesigned to help students develop their leadership skills in order to identify their personal and professional purpose with an entrepreneurial mindset, and create strategies that will help them develop their abilities and achieve their aspirations by collaborating within teams and organizations.  Students will apply insights from recent scholarship in entrepreneurship, leadership and strategic management to themselves in order to identify solutions to problems they find meaningful to solve in their own world.  This self-discovery course will introduce students to the \"CEO of ME, Inc.\" framework and tools such as the strategic initiatives matrix and business model canvas that they can use to help guide the choices that lie ahead, and develop collaborative, win-win relationships.  In doing so, students will learn how to unlock the value of business in society and develop entrepreneurial and leadership skills that enable personal happiness and upward mobility.\nAverage GPA: N/A","metadata":{"course_id":"BMGT262","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"The Enterprising Leader","type":"gen_ed"}},{"pageContent":"How Do Innovators Think?\nIn this course, students will learn about: a) the innovation process and the role of the individual in generating innovations and b) the attributes, habits, and skills of individuals who have successfully started innovative new businesses or significantly added value to an existing company.\nAverage GPA: N/A","metadata":{"course_id":"BMGT289B","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"How Do Innovators Think?","type":"gen_ed"}},{"pageContent":"Frauds, Scams, and Thefts: What, How and Why?\n\"Why\" does fraud happen? \"How\" does society address fraud? And \"What\" can you do to avoid and prevent fraud in your personal and future career life? This course is designed to give future professionals and managers of all disciplines a general background of fraud. Topics include the psychology of fraud, the mechanics of fraud, the legal landscape, securities fraud, cybercrime, and what all of us should know to protect ourselves from becoming victims of fraud. Additionally, students experience 21st century lessons in fraud examination that have practical application to our daily lives: avoiding cognitive biases, interviewing techniques, basic business controls, and opening our minds to see what others might miss...the red flags of fraud.\nAverage GPA: N/A","metadata":{"course_id":"BMGT289D","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Frauds, Scams, and Thefts: What, How and Why?","type":"gen_ed"}},{"pageContent":"Entrepreneurial Thinking for Non-Business Majors: How Not to Miss Great Opportunities Your Life Throws at You\nIn this course, students learn how to analyze the world around them and then notice and define new trends, emerging problems, impending gaps, and how to turn these into exciting opportunities by providing creative solutions.  Students will have a chance to not only sharpen their critical thinking skills, but also learn how to take initiative, develop a working solution, identify and resolve conflicts, and be confident and persistent, yet flexible enough to respond to changes. Student teams identify a compelling problem in present day life and then propose a creative solution taking into account possible difficulties in implementation.  In addition, students will also be given problems on a much smaller scale and asked to create and present a workable solution. Students will be exposed to how a visionary's mind works and the creative solution process.  In addition, students will also learn how entrepreneurial thinking can improve their day-to-day life.\nAverage GPA: N/A","metadata":{"course_id":"BMGT289E","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Entrepreneurial Thinking for Non-Business Majors: How Not to Miss Great Opportunities Your Life Throws at You","type":"gen_ed"}},{"pageContent":"Why Good Managers Make Bad Decisions\nThis course provides an overview of the concepts, approaches, and vocabulary of evidence-based management (EBM) and provides an understanding of how experts in many disciplines can employ evidenced based decision making. EBM is an emerging movement in business to explicitly use the current best information in management decision making with special emphasis on relevant scientific findings and unbiased organizational facts. The course stresses how individuals practicing EBM learn how to rethink their approaches to data and knowledge in order to make more effective decisions.\nAverage GPA: N/A","metadata":{"course_id":"BMGT289I","credits":"3","prerequisites":[],"gen_ed":[["DSSP","SCIS"]],"name":"Why Good Managers Make Bad Decisions","type":"gen_ed"}},{"pageContent":"Amazing Green: Plants that Transformed the World\nIn what profound ways have plants changed humanity and the world we live in today? An interactive way to learn about plants and science, focusing on how plants have changed human history, the biology of their growth, and the science behind their use.\nAverage GPA: N/A","metadata":{"course_id":"BSCI135","credits":"4","prerequisites":[],"gen_ed":[["DSNL","SCIS"]],"name":"Amazing Green: Plants that Transformed the World","type":"gen_ed"}},{"pageContent":"Beyond Race: Human Biological Diversity\nDo racial labels have any practical use in understanding human biological diversity?  Such categorizations are inextricably linked to racism, including a history of misuse in science going back hundreds of years, yet modern biological research and medicine often include the use of race.  At its core, addressing this question requires understanding the balance between genetic and non-genetic factors underlying human diversity.  The course will help students make an informed critique of the biological basis of race through the study of topics such as: basic biology, data analysis and experimental design, human evolution and genetics, and biomedical research and health outcomes.\nAverage GPA: N/A","metadata":{"course_id":"BSCI151","credits":"3","prerequisites":[],"gen_ed":[["DSNS"],["DSSP","DVUP","SCIS"]],"name":"Beyond Race: Human Biological Diversity","type":"gen_ed"}},{"pageContent":"The Public Microbe\nHow are microbes essential for human health yet cause so much disease? This course covers basic concepts in microbiology as they relate to human- microbe interactions by surveying the diversity of microbial life, the role our resident microbiota play in human health, modes of disease tracking, and prophylactic and therapeutic measures designed to control the spread of infectious disease.\nAverage GPA: N/A","metadata":{"course_id":"BSCI213","credits":"3","prerequisites":[],"gen_ed":[["DSNS","SCIS"]],"name":"The Public Microbe","type":"gen_ed"}},{"pageContent":"General Microbiology\nHow have microorganisms exploited every conceivable ecological niche, and how have humans harnessed this diversity to improve medicine, agriculture, and biotechnology? The course covers fundamental concepts in morphology, physiology, genetics, immunology, ecology, and pathogenic microbiology. Applications of microbiology to medicine, the food industry, and biotechnology.\nAverage GPA: N/A","metadata":{"course_id":"BSCI223","credits":"4","prerequisites":[],"gen_ed":[["DSNL","SCIS"]],"name":"General Microbiology","type":"gen_ed"}},{"pageContent":"Ensuring your Financial Future Through Stock Investing\nIntroduces students to investing and trading, with special emphasis on the field of technical analysis.  Planning for one's financial future is a critical skill for all students. Students will learn how to evaluate companies using the investors.com website and the TC2000 stock charting program.  Students will develop an idea of the risks and benefits of investing, establishing a savings strategy, opening an IRA, and strategically planning for future financial security.  In addition to readings, lectures,  and online videos, students will participate in virtual stock market trading exercises and manage a virtual account.\nAverage GPA: N/A","metadata":{"course_id":"BSOS201","credits":"3","prerequisites":[],"gen_ed":[["DSHS"],["DSSP","SCIS"]],"name":"Ensuring your Financial Future Through Stock Investing","type":"gen_ed"}},{"pageContent":"States of Emergency\nStudents will explore the manner in which crises unfold from the perspective of a variety of emergency response disciplines, including: emergency management, law enforcement, intelligence analysis, cyber analysis, risk communication, health and human services, and emergency psychiatry/psychology.  Students will participate in a semester-long simulation of an unfolding terrorist attack.\nAverage GPA: N/A","metadata":{"course_id":"BSST334","credits":"3","prerequisites":[],"gen_ed":[["DSHS","SCIS"]],"name":"States of Emergency","type":"gen_ed"}}]}